{
  "<EOS>": 0,
  "<PAD>": 1,
  "<SOS>": 2,
  "<UNK>": 3,
  "Ba1": 4,
  "Ba2": 5,
  "Ba2+": 6,
  "Ba3": 7,
  "Ba3+": 8,
  "Ba4": 9,
  "Ba4+": 10,
  "Ba5": 11,
  "Ba5+": 12,
  "Ba6": 13,
  "Ba6+": 14,
  "Ba7": 15,
  "Ba7+": 16,
  "Ba8": 17,
  "Bb1": 18,
  "Bb2": 19,
  "Bb2+": 20,
  "Bb3": 21,
  "Bb3+": 22,
  "Bb4": 23,
  "Bb4+": 24,
  "Bb5": 25,
  "Bb5+": 26,
  "Bb6": 27,
  "Bb6+": 28,
  "Bb7": 29,
  "Bb7+": 30,
  "Bb8": 31,
  "Bb8+": 32,
  "Bc1": 33,
  "Bc1+": 34,
  "Bc2": 35,
  "Bc2+": 36,
  "Bc3": 37,
  "Bc3+": 38,
  "Bc4": 39,
  "Bc4#": 40,
  "Bc4+": 41,
  "Bc5": 42,
  "Bc5#": 43,
  "Bc5+": 44,
  "Bc6": 45,
  "Bc6#": 46,
  "Bc6+": 47,
  "Bc7": 48,
  "Bc7+": 49,
  "Bc8": 50,
  "Bc8+": 51,
  "Bd1": 52,
  "Bd1+": 53,
  "Bd2": 54,
  "Bd2+": 55,
  "Bd3": 56,
  "Bd3#": 57,
  "Bd3+": 58,
  "Bd4": 59,
  "Bd4#": 60,
  "Bd4+": 61,
  "Bd5": 62,
  "Bd5#": 63,
  "Bd5+": 64,
  "Bd6": 65,
  "Bd6+": 66,
  "Bd7": 67,
  "Bd7+": 68,
  "Bd8": 69,
  "Bd8+": 70,
  "Be1": 71,
  "Be1+": 72,
  "Be2": 73,
  "Be2+": 74,
  "Be3": 75,
  "Be3#": 76,
  "Be3+": 77,
  "Be4": 78,
  "Be4+": 79,
  "Be5": 80,
  "Be5#": 81,
  "Be5+": 82,
  "Be6": 83,
  "Be6+": 84,
  "Be7": 85,
  "Be7+": 86,
  "Be8": 87,
  "Be8+": 88,
  "Bf1": 89,
  "Bf1#": 90,
  "Bf1+": 91,
  "Bf2": 92,
  "Bf2+": 93,
  "Bf3": 94,
  "Bf3#": 95,
  "Bf3+": 96,
  "Bf4": 97,
  "Bf4+": 98,
  "Bf5": 99,
  "Bf5#": 100,
  "Bf5+": 101,
  "Bf6": 102,
  "Bf6#": 103,
  "Bf6+": 104,
  "Bf7": 105,
  "Bf7#": 106,
  "Bf7+": 107,
  "Bf8": 108,
  "Bf8+": 109,
  "Bg1": 110,
  "Bg1+": 111,
  "Bg2": 112,
  "Bg2+": 113,
  "Bg3": 114,
  "Bg3+": 115,
  "Bg4": 116,
  "Bg4#": 117,
  "Bg4+": 118,
  "Bg5": 119,
  "Bg5#": 120,
  "Bg5+": 121,
  "Bg6": 122,
  "Bg6#": 123,
  "Bg6+": 124,
  "Bg7": 125,
  "Bg7#": 126,
  "Bg7+": 127,
  "Bg8": 128,
  "Bg8+": 129,
  "Bh1": 130,
  "Bh2": 131,
  "Bh2+": 132,
  "Bh3": 133,
  "Bh3+": 134,
  "Bh4": 135,
  "Bh4+": 136,
  "Bh5": 137,
  "Bh5+": 138,
  "Bh6": 139,
  "Bh6#": 140,
  "Bh6+": 141,
  "Bh7": 142,
  "Bh7+": 143,
  "Bh8": 144,
  "Bxa1": 145,
  "Bxa2": 146,
  "Bxa2+": 147,
  "Bxa3": 148,
  "Bxa3+": 149,
  "Bxa4": 150,
  "Bxa4+": 151,
  "Bxa5": 152,
  "Bxa5+": 153,
  "Bxa6": 154,
  "Bxa6+": 155,
  "Bxa7": 156,
  "Bxa7+": 157,
  "Bxa8": 158,
  "Bxb1": 159,
  "Bxb2": 160,
  "Bxb2+": 161,
  "Bxb3": 162,
  "Bxb3+": 163,
  "Bxb4": 164,
  "Bxb4+": 165,
  "Bxb5": 166,
  "Bxb5+": 167,
  "Bxb6": 168,
  "Bxb6+": 169,
  "Bxb7": 170,
  "Bxb7+": 171,
  "Bxb8": 172,
  "Bxc1": 173,
  "Bxc2": 174,
  "Bxc2+": 175,
  "Bxc3": 176,
  "Bxc3+": 177,
  "Bxc4": 178,
  "Bxc4+": 179,
  "Bxc5": 180,
  "Bxc5+": 181,
  "Bxc6": 182,
  "Bxc6+": 183,
  "Bxc7": 184,
  "Bxc7+": 185,
  "Bxc8": 186,
  "Bxc8+": 187,
  "Bxd1": 188,
  "Bxd1+": 189,
  "Bxd2": 190,
  "Bxd2+": 191,
  "Bxd3": 192,
  "Bxd3+": 193,
  "Bxd4": 194,
  "Bxd4+": 195,
  "Bxd5": 196,
  "Bxd5+": 197,
  "Bxd6": 198,
  "Bxd6+": 199,
  "Bxd7": 200,
  "Bxd7+": 201,
  "Bxd8": 202,
  "Bxd8+": 203,
  "Bxe1": 204,
  "Bxe1+": 205,
  "Bxe2": 206,
  "Bxe2+": 207,
  "Bxe3": 208,
  "Bxe3+": 209,
  "Bxe4": 210,
  "Bxe4+": 211,
  "Bxe5": 212,
  "Bxe5+": 213,
  "Bxe6": 214,
  "Bxe6#": 215,
  "Bxe6+": 216,
  "Bxe7": 217,
  "Bxe7+": 218,
  "Bxe8": 219,
  "Bxf1": 220,
  "Bxf2": 221,
  "Bxf2#": 222,
  "Bxf2+": 223,
  "Bxf3": 224,
  "Bxf3#": 225,
  "Bxf3+": 226,
  "Bxf4": 227,
  "Bxf4+": 228,
  "Bxf5": 229,
  "Bxf5+": 230,
  "Bxf6": 231,
  "Bxf6#": 232,
  "Bxf6+": 233,
  "Bxf7": 234,
  "Bxf7#": 235,
  "Bxf7+": 236,
  "Bxf8": 237,
  "Bxf8+": 238,
  "Bxg1": 239,
  "Bxg2": 240,
  "Bxg2+": 241,
  "Bxg3": 242,
  "Bxg3+": 243,
  "Bxg4": 244,
  "Bxg4+": 245,
  "Bxg5": 246,
  "Bxg5+": 247,
  "Bxg6": 248,
  "Bxg6+": 249,
  "Bxg7": 250,
  "Bxg7+": 251,
  "Bxg8": 252,
  "Bxh1": 253,
  "Bxh2": 254,
  "Bxh2+": 255,
  "Bxh3": 256,
  "Bxh3+": 257,
  "Bxh4": 258,
  "Bxh4+": 259,
  "Bxh5": 260,
  "Bxh5+": 261,
  "Bxh6": 262,
  "Bxh6+": 263,
  "Bxh7": 264,
  "Bxh7+": 265,
  "Bxh8": 266,
  "Ka1": 267,
  "Ka2": 268,
  "Ka3": 269,
  "Ka4": 270,
  "Ka5": 271,
  "Ka6": 272,
  "Ka7": 273,
  "Ka8": 274,
  "Kb1": 275,
  "Kb2": 276,
  "Kb3": 277,
  "Kb4": 278,
  "Kb5": 279,
  "Kb6": 280,
  "Kb7": 281,
  "Kb8": 282,
  "Kc1": 283,
  "Kc2": 284,
  "Kc3": 285,
  "Kc4": 286,
  "Kc4+": 287,
  "Kc5": 288,
  "Kc6": 289,
  "Kc7": 290,
  "Kc8": 291,
  "Kd1": 292,
  "Kd2": 293,
  "Kd3": 294,
  "Kd4": 295,
  "Kd5": 296,
  "Kd5+": 297,
  "Kd6": 298,
  "Kd7": 299,
  "Kd7+": 300,
  "Kd8": 301,
  "Ke1": 302,
  "Ke2": 303,
  "Ke3": 304,
  "Ke3+": 305,
  "Ke4": 306,
  "Ke5": 307,
  "Ke6": 308,
  "Ke6+": 309,
  "Ke7": 310,
  "Ke8": 311,
  "Kf1": 312,
  "Kf1+": 313,
  "Kf2": 314,
  "Kf3": 315,
  "Kf3+": 316,
  "Kf4": 317,
  "Kf5": 318,
  "Kf6": 319,
  "Kf7": 320,
  "Kf8": 321,
  "Kg1": 322,
  "Kg2": 323,
  "Kg3": 324,
  "Kg3+": 325,
  "Kg4": 326,
  "Kg5": 327,
  "Kg6": 328,
  "Kg7": 329,
  "Kg8": 330,
  "Kh1": 331,
  "Kh2": 332,
  "Kh3": 333,
  "Kh4": 334,
  "Kh5": 335,
  "Kh6": 336,
  "Kh7": 337,
  "Kh8": 338,
  "Kxa1": 339,
  "Kxa2": 340,
  "Kxa3": 341,
  "Kxa4": 342,
  "Kxa5": 343,
  "Kxa6": 344,
  "Kxa7": 345,
  "Kxa8": 346,
  "Kxb1": 347,
  "Kxb2": 348,
  "Kxb3": 349,
  "Kxb4": 350,
  "Kxb5": 351,
  "Kxb6": 352,
  "Kxb7": 353,
  "Kxb8": 354,
  "Kxc1": 355,
  "Kxc2": 356,
  "Kxc3": 357,
  "Kxc4": 358,
  "Kxc5": 359,
  "Kxc6": 360,
  "Kxc7": 361,
  "Kxc8": 362,
  "Kxd1": 363,
  "Kxd2": 364,
  "Kxd3": 365,
  "Kxd4": 366,
  "Kxd5": 367,
  "Kxd6": 368,
  "Kxd7": 369,
  "Kxd8": 370,
  "Kxe1": 371,
  "Kxe2": 372,
  "Kxe3": 373,
  "Kxe4": 374,
  "Kxe5": 375,
  "Kxe6": 376,
  "Kxe7": 377,
  "Kxe8": 378,
  "Kxf1": 379,
  "Kxf2": 380,
  "Kxf3": 381,
  "Kxf4": 382,
  "Kxf5": 383,
  "Kxf6": 384,
  "Kxf7": 385,
  "Kxf8": 386,
  "Kxg1": 387,
  "Kxg2": 388,
  "Kxg3": 389,
  "Kxg4": 390,
  "Kxg5": 391,
  "Kxg6": 392,
  "Kxg7": 393,
  "Kxg8": 394,
  "Kxh1": 395,
  "Kxh2": 396,
  "Kxh3": 397,
  "Kxh4": 398,
  "Kxh5": 399,
  "Kxh6": 400,
  "Kxh7": 401,
  "Kxh8": 402,
  "N1c3": 403,
  "N1d2": 404,
  "N1e2": 405,
  "N1h2": 406,
  "N2b3": 407,
  "N2c3": 408,
  "N2f3": 409,
  "N2g3": 410,
  "N3e4": 411,
  "N3h4": 412,
  "N4a6": 413,
  "N4b3": 414,
  "N4c6": 415,
  "N5c3": 416,
  "N5c6": 417,
  "N5f6": 418,
  "N6d5": 419,
  "N6d7": 420,
  "N6e5": 421,
  "N6h5": 422,
  "N7b6": 423,
  "N7c6": 424,
  "N7f6": 425,
  "N7g6": 426,
  "N8c6": 427,
  "N8d7": 428,
  "N8e7": 429,
  "N8f6": 430,
  "Na1": 431,
  "Na2": 432,
  "Na2+": 433,
  "Na3": 434,
  "Na3+": 435,
  "Na4": 436,
  "Na4+": 437,
  "Na5": 438,
  "Na5+": 439,
  "Na6": 440,
  "Na6+": 441,
  "Na7": 442,
  "Na7+": 443,
  "Na8": 444,
  "Nab5": 445,
  "Nac2": 446,
  "Nac3": 447,
  "Nac4": 448,
  "Nac5": 449,
  "Nac6": 450,
  "Nac7": 451,
  "Naxc4": 452,
  "Naxc5": 453,
  "Nb1": 454,
  "Nb1+": 455,
  "Nb2": 456,
  "Nb2+": 457,
  "Nb3": 458,
  "Nb3+": 459,
  "Nb4": 460,
  "Nb4+": 461,
  "Nb5": 462,
  "Nb5+": 463,
  "Nb6": 464,
  "Nb6+": 465,
  "Nb7": 466,
  "Nb7+": 467,
  "Nb8": 468,
  "Nb8+": 469,
  "Nba6": 470,
  "Nbc3": 471,
  "Nbc4": 472,
  "Nbc5": 473,
  "Nbc6": 474,
  "Nbd2": 475,
  "Nbd3": 476,
  "Nbd4": 477,
  "Nbd5": 478,
  "Nbd6": 479,
  "Nbd7": 480,
  "Nbxc3": 481,
  "Nbxd2": 482,
  "Nbxd4": 483,
  "Nbxd5": 484,
  "Nbxd7": 485,
  "Nc1": 486,
  "Nc1+": 487,
  "Nc2": 488,
  "Nc2#": 489,
  "Nc2+": 490,
  "Nc3": 491,
  "Nc3#": 492,
  "Nc3+": 493,
  "Nc4": 494,
  "Nc4+": 495,
  "Nc5": 496,
  "Nc5+": 497,
  "Nc6": 498,
  "Nc6+": 499,
  "Nc7": 500,
  "Nc7#": 501,
  "Nc7+": 502,
  "Nc8": 503,
  "Nc8+": 504,
  "Ncb4": 505,
  "Ncb5": 506,
  "Ncb6": 507,
  "Ncd2": 508,
  "Ncd3+": 509,
  "Ncd4": 510,
  "Ncd4+": 511,
  "Ncd5": 512,
  "Ncd5+": 513,
  "Ncd6": 514,
  "Ncd7": 515,
  "Nce2": 516,
  "Nce3": 517,
  "Nce4": 518,
  "Nce5": 519,
  "Nce6": 520,
  "Nce7": 521,
  "Ncxb5": 522,
  "Ncxd2": 523,
  "Ncxd4": 524,
  "Ncxd5": 525,
  "Ncxe2": 526,
  "Ncxe4": 527,
  "Ncxe5": 528,
  "Ncxe6": 529,
  "Ncxe7": 530,
  "Nd1": 531,
  "Nd1+": 532,
  "Nd2": 533,
  "Nd2+": 534,
  "Nd3": 535,
  "Nd3#": 536,
  "Nd3+": 537,
  "Nd4": 538,
  "Nd4+": 539,
  "Nd5": 540,
  "Nd5#": 541,
  "Nd5+": 542,
  "Nd6": 543,
  "Nd6#": 544,
  "Nd6+": 545,
  "Nd7": 546,
  "Nd7+": 547,
  "Nd8": 548,
  "Nd8+": 549,
  "Ndb4": 550,
  "Ndb5": 551,
  "Ndc3": 552,
  "Ndc4": 553,
  "Ndc5": 554,
  "Ndc6": 555,
  "Nde2": 556,
  "Nde3": 557,
  "Nde4": 558,
  "Nde5": 559,
  "Nde6": 560,
  "Nde7": 561,
  "Ndf3": 562,
  "Ndf4": 563,
  "Ndf5": 564,
  "Ndf6": 565,
  "Ndf8": 566,
  "Ndxb4": 567,
  "Ndxb5": 568,
  "Ndxc4": 569,
  "Ndxc5": 570,
  "Ndxe2": 571,
  "Ndxe4": 572,
  "Ndxe5": 573,
  "Ndxf3": 574,
  "Ndxf7": 575,
  "Ne1": 576,
  "Ne1+": 577,
  "Ne2": 578,
  "Ne2+": 579,
  "Ne3": 580,
  "Ne3+": 581,
  "Ne4": 582,
  "Ne4+": 583,
  "Ne5": 584,
  "Ne5+": 585,
  "Ne6": 586,
  "Ne6+": 587,
  "Ne7": 588,
  "Ne7+": 589,
  "Ne8": 590,
  "Ne8+": 591,
  "Nec3": 592,
  "Nec4": 593,
  "Nec5": 594,
  "Nec6": 595,
  "Ned2": 596,
  "Ned3": 597,
  "Ned4": 598,
  "Ned5": 599,
  "Ned6": 600,
  "Ned7": 601,
  "Nef3": 602,
  "Nef4": 603,
  "Nef5": 604,
  "Nef5+": 605,
  "Nef6": 606,
  "Neg3": 607,
  "Neg4": 608,
  "Neg5": 609,
  "Neg5+": 610,
  "Neg6": 611,
  "Nexd4": 612,
  "Nexd5": 613,
  "Nexd7": 614,
  "Nexg4": 615,
  "Nexg5": 616,
  "Nf1": 617,
  "Nf1+": 618,
  "Nf2": 619,
  "Nf2#": 620,
  "Nf2+": 621,
  "Nf3": 622,
  "Nf3#": 623,
  "Nf3+": 624,
  "Nf4": 625,
  "Nf4+": 626,
  "Nf5": 627,
  "Nf5+": 628,
  "Nf6": 629,
  "Nf6#": 630,
  "Nf6+": 631,
  "Nf7": 632,
  "Nf7#": 633,
  "Nf7+": 634,
  "Nf8": 635,
  "Nf8+": 636,
  "Nfd2": 637,
  "Nfd4": 638,
  "Nfd5": 639,
  "Nfd7": 640,
  "Nfe2": 641,
  "Nfe3": 642,
  "Nfe4": 643,
  "Nfe5": 644,
  "Nfe7": 645,
  "Nfg3": 646,
  "Nfg4": 647,
  "Nfg5": 648,
  "Nfg6": 649,
  "Nfxd2": 650,
  "Nfxd4": 651,
  "Nfxd5": 652,
  "Nfxd7": 653,
  "Nfxe4": 654,
  "Nfxe5": 655,
  "Nfxg4": 656,
  "Nfxg5": 657,
  "Ng1": 658,
  "Ng1+": 659,
  "Ng2": 660,
  "Ng2+": 661,
  "Ng3": 662,
  "Ng3#": 663,
  "Ng3+": 664,
  "Ng4": 665,
  "Ng4+": 666,
  "Ng5": 667,
  "Ng5#": 668,
  "Ng5+": 669,
  "Ng6": 670,
  "Ng6+": 671,
  "Ng7": 672,
  "Ng7+": 673,
  "Ng8": 674,
  "Ng8+": 675,
  "Nge2": 676,
  "Nge3": 677,
  "Nge4": 678,
  "Nge5": 679,
  "Nge6": 680,
  "Nge7": 681,
  "Ngf3": 682,
  "Ngf6": 683,
  "Ngh3": 684,
  "Ngxe2": 685,
  "Ngxe4": 686,
  "Ngxe5": 687,
  "Ngxe6": 688,
  "Ngxe7": 689,
  "Ngxf6": 690,
  "Ngxf7": 691,
  "Nh1": 692,
  "Nh1+": 693,
  "Nh2": 694,
  "Nh2+": 695,
  "Nh3": 696,
  "Nh3+": 697,
  "Nh4": 698,
  "Nh4+": 699,
  "Nh5": 700,
  "Nh5+": 701,
  "Nh6": 702,
  "Nh6+": 703,
  "Nh7": 704,
  "Nh7+": 705,
  "Nh8": 706,
  "Nh8+": 707,
  "Nhf3": 708,
  "Nhf4": 709,
  "Nhf5": 710,
  "Nhf6": 711,
  "Nhg4": 712,
  "Nhg5": 713,
  "Nhxf4": 714,
  "Nxa1": 715,
  "Nxa2": 716,
  "Nxa2+": 717,
  "Nxa3": 718,
  "Nxa3+": 719,
  "Nxa4": 720,
  "Nxa4+": 721,
  "Nxa5": 722,
  "Nxa5+": 723,
  "Nxa6": 724,
  "Nxa6+": 725,
  "Nxa7": 726,
  "Nxa7+": 727,
  "Nxa8": 728,
  "Nxa8+": 729,
  "Nxb1": 730,
  "Nxb2": 731,
  "Nxb2+": 732,
  "Nxb3": 733,
  "Nxb3+": 734,
  "Nxb4": 735,
  "Nxb4+": 736,
  "Nxb5": 737,
  "Nxb5+": 738,
  "Nxb6": 739,
  "Nxb6+": 740,
  "Nxb7": 741,
  "Nxb7+": 742,
  "Nxb8": 743,
  "Nxb8+": 744,
  "Nxc1": 745,
  "Nxc1+": 746,
  "Nxc2": 747,
  "Nxc2+": 748,
  "Nxc3": 749,
  "Nxc3+": 750,
  "Nxc4": 751,
  "Nxc4+": 752,
  "Nxc5": 753,
  "Nxc5+": 754,
  "Nxc6": 755,
  "Nxc6+": 756,
  "Nxc7": 757,
  "Nxc7#": 758,
  "Nxc7+": 759,
  "Nxc8": 760,
  "Nxc8+": 761,
  "Nxd1": 762,
  "Nxd1+": 763,
  "Nxd2": 764,
  "Nxd2+": 765,
  "Nxd3": 766,
  "Nxd3+": 767,
  "Nxd4": 768,
  "Nxd4+": 769,
  "Nxd5": 770,
  "Nxd5+": 771,
  "Nxd6": 772,
  "Nxd6+": 773,
  "Nxd7": 774,
  "Nxd7+": 775,
  "Nxd8": 776,
  "Nxd8+": 777,
  "Nxe1": 778,
  "Nxe1+": 779,
  "Nxe2": 780,
  "Nxe2+": 781,
  "Nxe3": 782,
  "Nxe3+": 783,
  "Nxe4": 784,
  "Nxe4+": 785,
  "Nxe5": 786,
  "Nxe5+": 787,
  "Nxe6": 788,
  "Nxe6+": 789,
  "Nxe7": 790,
  "Nxe7+": 791,
  "Nxe8": 792,
  "Nxe8+": 793,
  "Nxf1": 794,
  "Nxf1+": 795,
  "Nxf2": 796,
  "Nxf2#": 797,
  "Nxf2+": 798,
  "Nxf3": 799,
  "Nxf3+": 800,
  "Nxf4": 801,
  "Nxf4+": 802,
  "Nxf5": 803,
  "Nxf5+": 804,
  "Nxf6": 805,
  "Nxf6+": 806,
  "Nxf7": 807,
  "Nxf7#": 808,
  "Nxf7+": 809,
  "Nxf8": 810,
  "Nxf8+": 811,
  "Nxg1": 812,
  "Nxg1+": 813,
  "Nxg2": 814,
  "Nxg2+": 815,
  "Nxg3": 816,
  "Nxg3+": 817,
  "Nxg4": 818,
  "Nxg4+": 819,
  "Nxg5": 820,
  "Nxg5+": 821,
  "Nxg6": 822,
  "Nxg6+": 823,
  "Nxg7": 824,
  "Nxg7+": 825,
  "Nxg8": 826,
  "Nxg8+": 827,
  "Nxh1": 828,
  "Nxh1+": 829,
  "Nxh2": 830,
  "Nxh2+": 831,
  "Nxh3": 832,
  "Nxh3+": 833,
  "Nxh4": 834,
  "Nxh4+": 835,
  "Nxh5": 836,
  "Nxh5+": 837,
  "Nxh6": 838,
  "Nxh6+": 839,
  "Nxh7": 840,
  "Nxh7+": 841,
  "Nxh8": 842,
  "Nxh8+": 843,
  "O-O": 844,
  "O-O+": 845,
  "O-O-O": 846,
  "O-O-O+": 847,
  "Qa1": 848,
  "Qa1#": 849,
  "Qa1+": 850,
  "Qa2": 851,
  "Qa2#": 852,
  "Qa2+": 853,
  "Qa3": 854,
  "Qa3#": 855,
  "Qa3+": 856,
  "Qa4": 857,
  "Qa4#": 858,
  "Qa4+": 859,
  "Qa5": 860,
  "Qa5#": 861,
  "Qa5+": 862,
  "Qa6": 863,
  "Qa6#": 864,
  "Qa6+": 865,
  "Qa7": 866,
  "Qa7#": 867,
  "Qa7+": 868,
  "Qa8": 869,
  "Qa8#": 870,
  "Qa8+": 871,
  "Qb1": 872,
  "Qb1#": 873,
  "Qb1+": 874,
  "Qb2": 875,
  "Qb2#": 876,
  "Qb2+": 877,
  "Qb3": 878,
  "Qb3#": 879,
  "Qb3+": 880,
  "Qb4": 881,
  "Qb4#": 882,
  "Qb4+": 883,
  "Qb5": 884,
  "Qb5#": 885,
  "Qb5+": 886,
  "Qb6": 887,
  "Qb6#": 888,
  "Qb6+": 889,
  "Qb7": 890,
  "Qb7#": 891,
  "Qb7+": 892,
  "Qb8": 893,
  "Qb8#": 894,
  "Qb8+": 895,
  "Qbb7+": 896,
  "Qc1": 897,
  "Qc1#": 898,
  "Qc1+": 899,
  "Qc2": 900,
  "Qc2#": 901,
  "Qc2+": 902,
  "Qc3": 903,
  "Qc3#": 904,
  "Qc3+": 905,
  "Qc4": 906,
  "Qc4#": 907,
  "Qc4+": 908,
  "Qc5": 909,
  "Qc5#": 910,
  "Qc5+": 911,
  "Qc6": 912,
  "Qc6#": 913,
  "Qc6+": 914,
  "Qc7": 915,
  "Qc7#": 916,
  "Qc7+": 917,
  "Qc8": 918,
  "Qc8#": 919,
  "Qc8+": 920,
  "Qca2#": 921,
  "Qd1": 922,
  "Qd1#": 923,
  "Qd1+": 924,
  "Qd2": 925,
  "Qd2#": 926,
  "Qd2+": 927,
  "Qd3": 928,
  "Qd3#": 929,
  "Qd3+": 930,
  "Qd4": 931,
  "Qd4#": 932,
  "Qd4+": 933,
  "Qd5": 934,
  "Qd5#": 935,
  "Qd5+": 936,
  "Qd6": 937,
  "Qd6#": 938,
  "Qd6+": 939,
  "Qd7": 940,
  "Qd7#": 941,
  "Qd7+": 942,
  "Qd8": 943,
  "Qd8#": 944,
  "Qd8+": 945,
  "Qe1": 946,
  "Qe1#": 947,
  "Qe1+": 948,
  "Qe2": 949,
  "Qe2#": 950,
  "Qe2+": 951,
  "Qe3": 952,
  "Qe3#": 953,
  "Qe3+": 954,
  "Qe4": 955,
  "Qe4#": 956,
  "Qe4+": 957,
  "Qe5": 958,
  "Qe5#": 959,
  "Qe5+": 960,
  "Qe6": 961,
  "Qe6#": 962,
  "Qe6+": 963,
  "Qe7": 964,
  "Qe7#": 965,
  "Qe7+": 966,
  "Qe8": 967,
  "Qe8#": 968,
  "Qe8+": 969,
  "Qf1": 970,
  "Qf1#": 971,
  "Qf1+": 972,
  "Qf2": 973,
  "Qf2#": 974,
  "Qf2+": 975,
  "Qf3": 976,
  "Qf3#": 977,
  "Qf3+": 978,
  "Qf4": 979,
  "Qf4#": 980,
  "Qf4+": 981,
  "Qf5": 982,
  "Qf5#": 983,
  "Qf5+": 984,
  "Qf6": 985,
  "Qf6#": 986,
  "Qf6+": 987,
  "Qf7": 988,
  "Qf7#": 989,
  "Qf7+": 990,
  "Qf8": 991,
  "Qf8#": 992,
  "Qf8+": 993,
  "Qg1": 994,
  "Qg1#": 995,
  "Qg1+": 996,
  "Qg2": 997,
  "Qg2#": 998,
  "Qg2+": 999,
  "Qg3": 1000,
  "Qg3#": 1001,
  "Qg3+": 1002,
  "Qg4": 1003,
  "Qg4#": 1004,
  "Qg4+": 1005,
  "Qg5": 1006,
  "Qg5#": 1007,
  "Qg5+": 1008,
  "Qg6": 1009,
  "Qg6#": 1010,
  "Qg6+": 1011,
  "Qg7": 1012,
  "Qg7#": 1013,
  "Qg7+": 1014,
  "Qg8": 1015,
  "Qg8#": 1016,
  "Qg8+": 1017,
  "Qh1": 1018,
  "Qh1#": 1019,
  "Qh1+": 1020,
  "Qh2": 1021,
  "Qh2#": 1022,
  "Qh2+": 1023,
  "Qh3": 1024,
  "Qh3#": 1025,
  "Qh3+": 1026,
  "Qh4": 1027,
  "Qh4#": 1028,
  "Qh4+": 1029,
  "Qh5": 1030,
  "Qh5#": 1031,
  "Qh5+": 1032,
  "Qh6": 1033,
  "Qh6#": 1034,
  "Qh6+": 1035,
  "Qh7": 1036,
  "Qh7#": 1037,
  "Qh7+": 1038,
  "Qh8": 1039,
  "Qh8#": 1040,
  "Qh8+": 1041,
  "Qxa1": 1042,
  "Qxa1+": 1043,
  "Qxa2": 1044,
  "Qxa2#": 1045,
  "Qxa2+": 1046,
  "Qxa3": 1047,
  "Qxa3+": 1048,
  "Qxa4": 1049,
  "Qxa4+": 1050,
  "Qxa5": 1051,
  "Qxa5+": 1052,
  "Qxa6": 1053,
  "Qxa6+": 1054,
  "Qxa7": 1055,
  "Qxa7+": 1056,
  "Qxa8": 1057,
  "Qxa8+": 1058,
  "Qxb1": 1059,
  "Qxb1+": 1060,
  "Qxb2": 1061,
  "Qxb2#": 1062,
  "Qxb2+": 1063,
  "Qxb3": 1064,
  "Qxb3+": 1065,
  "Qxb4": 1066,
  "Qxb4#": 1067,
  "Qxb4+": 1068,
  "Qxb5": 1069,
  "Qxb5#": 1070,
  "Qxb5+": 1071,
  "Qxb6": 1072,
  "Qxb6+": 1073,
  "Qxb7": 1074,
  "Qxb7#": 1075,
  "Qxb7+": 1076,
  "Qxb8": 1077,
  "Qxb8+": 1078,
  "Qxc1": 1079,
  "Qxc1#": 1080,
  "Qxc1+": 1081,
  "Qxc2": 1082,
  "Qxc2#": 1083,
  "Qxc2+": 1084,
  "Qxc3": 1085,
  "Qxc3+": 1086,
  "Qxc4": 1087,
  "Qxc4+": 1088,
  "Qxc5": 1089,
  "Qxc5+": 1090,
  "Qxc6": 1091,
  "Qxc6#": 1092,
  "Qxc6+": 1093,
  "Qxc7": 1094,
  "Qxc7#": 1095,
  "Qxc7+": 1096,
  "Qxc8": 1097,
  "Qxc8#": 1098,
  "Qxc8+": 1099,
  "Qxd1": 1100,
  "Qxd1#": 1101,
  "Qxd1+": 1102,
  "Qxd2": 1103,
  "Qxd2#": 1104,
  "Qxd2+": 1105,
  "Qxd3": 1106,
  "Qxd3+": 1107,
  "Qxd4": 1108,
  "Qxd4+": 1109,
  "Qxd5": 1110,
  "Qxd5#": 1111,
  "Qxd5+": 1112,
  "Qxd6": 1113,
  "Qxd6+": 1114,
  "Qxd7": 1115,
  "Qxd7#": 1116,
  "Qxd7+": 1117,
  "Qxd8": 1118,
  "Qxd8#": 1119,
  "Qxd8+": 1120,
  "Qxe1": 1121,
  "Qxe1#": 1122,
  "Qxe1+": 1123,
  "Qxe2": 1124,
  "Qxe2#": 1125,
  "Qxe2+": 1126,
  "Qxe3": 1127,
  "Qxe3+": 1128,
  "Qxe4": 1129,
  "Qxe4+": 1130,
  "Qxe5": 1131,
  "Qxe5+": 1132,
  "Qxe6": 1133,
  "Qxe6#": 1134,
  "Qxe6+": 1135,
  "Qxe7": 1136,
  "Qxe7#": 1137,
  "Qxe7+": 1138,
  "Qxe8": 1139,
  "Qxe8#": 1140,
  "Qxe8+": 1141,
  "Qxf1": 1142,
  "Qxf1#": 1143,
  "Qxf1+": 1144,
  "Qxf2": 1145,
  "Qxf2#": 1146,
  "Qxf2+": 1147,
  "Qxf3": 1148,
  "Qxf3#": 1149,
  "Qxf3+": 1150,
  "Qxf4": 1151,
  "Qxf4#": 1152,
  "Qxf4+": 1153,
  "Qxf5": 1154,
  "Qxf5+": 1155,
  "Qxf6": 1156,
  "Qxf6#": 1157,
  "Qxf6+": 1158,
  "Qxf7": 1159,
  "Qxf7#": 1160,
  "Qxf7+": 1161,
  "Qxf8": 1162,
  "Qxf8#": 1163,
  "Qxf8+": 1164,
  "Qxg1": 1165,
  "Qxg1#": 1166,
  "Qxg1+": 1167,
  "Qxg2": 1168,
  "Qxg2#": 1169,
  "Qxg2+": 1170,
  "Qxg3": 1171,
  "Qxg3#": 1172,
  "Qxg3+": 1173,
  "Qxg4": 1174,
  "Qxg4#": 1175,
  "Qxg4+": 1176,
  "Qxg5": 1177,
  "Qxg5#": 1178,
  "Qxg5+": 1179,
  "Qxg6": 1180,
  "Qxg6#": 1181,
  "Qxg6+": 1182,
  "Qxg7": 1183,
  "Qxg7#": 1184,
  "Qxg7+": 1185,
  "Qxg8": 1186,
  "Qxg8#": 1187,
  "Qxg8+": 1188,
  "Qxh1": 1189,
  "Qxh1+": 1190,
  "Qxh2": 1191,
  "Qxh2#": 1192,
  "Qxh2+": 1193,
  "Qxh3": 1194,
  "Qxh3#": 1195,
  "Qxh3+": 1196,
  "Qxh4": 1197,
  "Qxh4+": 1198,
  "Qxh5": 1199,
  "Qxh5#": 1200,
  "Qxh5+": 1201,
  "Qxh6": 1202,
  "Qxh6#": 1203,
  "Qxh6+": 1204,
  "Qxh7": 1205,
  "Qxh7#": 1206,
  "Qxh7+": 1207,
  "Qxh8": 1208,
  "Qxh8+": 1209,
  "R1a2": 1210,
  "R1b2": 1211,
  "R1c2": 1212,
  "R1c4": 1213,
  "R1d2": 1214,
  "R1d2+": 1215,
  "R1d3": 1216,
  "R1d4": 1217,
  "R1d5": 1218,
  "R1d6": 1219,
  "R1d7+": 1220,
  "R1e2": 1221,
  "R1e3": 1222,
  "R1e5": 1223,
  "R1e7+": 1224,
  "R1f2": 1225,
  "R1f3": 1226,
  "R1h2": 1227,
  "R2e3+": 1228,
  "R3d2": 1229,
  "R3d5": 1230,
  "R3e2": 1231,
  "R4d5": 1232,
  "R4e2": 1233,
  "R5d2": 1234,
  "R5f6": 1235,
  "R6d2": 1236,
  "R6d3": 1237,
  "R6d7": 1238,
  "R6f5": 1239,
  "R6f7": 1240,
  "R7c6": 1241,
  "R7d6+": 1242,
  "R7g6+": 1243,
  "R8c6": 1244,
  "R8c7": 1245,
  "R8d2": 1246,
  "R8d2+": 1247,
  "R8d6": 1248,
  "R8d7": 1249,
  "R8e2": 1250,
  "R8e2+": 1251,
  "R8e5": 1252,
  "R8e6": 1253,
  "R8e7": 1254,
  "R8f6": 1255,
  "R8f7": 1256,
  "R8g7": 1257,
  "Ra1": 1258,
  "Ra1#": 1259,
  "Ra1+": 1260,
  "Ra2": 1261,
  "Ra2#": 1262,
  "Ra2+": 1263,
  "Ra3": 1264,
  "Ra3#": 1265,
  "Ra3+": 1266,
  "Ra4": 1267,
  "Ra4#": 1268,
  "Ra4+": 1269,
  "Ra5": 1270,
  "Ra5#": 1271,
  "Ra5+": 1272,
  "Ra6": 1273,
  "Ra6#": 1274,
  "Ra6+": 1275,
  "Ra7": 1276,
  "Ra7#": 1277,
  "Ra7+": 1278,
  "Ra8": 1279,
  "Ra8#": 1280,
  "Ra8+": 1281,
  "Raa1": 1282,
  "Raa2": 1283,
  "Raa3": 1284,
  "Raa6": 1285,
  "Raa7": 1286,
  "Raa8": 1287,
  "Rab1": 1288,
  "Rab1+": 1289,
  "Rab2": 1290,
  "Rab3": 1291,
  "Rab6": 1292,
  "Rab7": 1293,
  "Rab8": 1294,
  "Rab8+": 1295,
  "Rac1": 1296,
  "Rac1+": 1297,
  "Rac8": 1298,
  "Rac8+": 1299,
  "Rad1": 1300,
  "Rad1+": 1301,
  "Rad8": 1302,
  "Rad8+": 1303,
  "Rae1": 1304,
  "Rae1+": 1305,
  "Rae2": 1306,
  "Rae7": 1307,
  "Rae8": 1308,
  "Rae8+": 1309,
  "Raf1": 1310,
  "Raf2": 1311,
  "Raf8": 1312,
  "Rag1": 1313,
  "Rag8": 1314,
  "Rah1": 1315,
  "Rah7": 1316,
  "Rah8": 1317,
  "Raxa3": 1318,
  "Raxa7": 1319,
  "Raxb1": 1320,
  "Raxb8": 1321,
  "Raxc1": 1322,
  "Raxc8": 1323,
  "Raxd1": 1324,
  "Raxd8": 1325,
  "Raxe1": 1326,
  "Raxe8": 1327,
  "Rb1": 1328,
  "Rb1#": 1329,
  "Rb1+": 1330,
  "Rb2": 1331,
  "Rb2+": 1332,
  "Rb3": 1333,
  "Rb3+": 1334,
  "Rb4": 1335,
  "Rb4+": 1336,
  "Rb5": 1337,
  "Rb5+": 1338,
  "Rb6": 1339,
  "Rb6+": 1340,
  "Rb7": 1341,
  "Rb7+": 1342,
  "Rb8": 1343,
  "Rb8#": 1344,
  "Rb8+": 1345,
  "Rba1": 1346,
  "Rba3": 1347,
  "Rba8": 1348,
  "Rbb1": 1349,
  "Rbb2": 1350,
  "Rbb3": 1351,
  "Rbb6": 1352,
  "Rbb7": 1353,
  "Rbb8": 1354,
  "Rbc1": 1355,
  "Rbc2": 1356,
  "Rbc3": 1357,
  "Rbc7": 1358,
  "Rbc8": 1359,
  "Rbd1": 1360,
  "Rbd1+": 1361,
  "Rbd7": 1362,
  "Rbd8": 1363,
  "Rbe1": 1364,
  "Rbe2": 1365,
  "Rbe7": 1366,
  "Rbe8": 1367,
  "Rbf1": 1368,
  "Rbf8": 1369,
  "Rbg1": 1370,
  "Rbg8": 1371,
  "Rbxb7": 1372,
  "Rbxc1": 1373,
  "Rbxc8": 1374,
  "Rc1": 1375,
  "Rc1#": 1376,
  "Rc1+": 1377,
  "Rc2": 1378,
  "Rc2+": 1379,
  "Rc3": 1380,
  "Rc3+": 1381,
  "Rc4": 1382,
  "Rc4+": 1383,
  "Rc5": 1384,
  "Rc5#": 1385,
  "Rc5+": 1386,
  "Rc6": 1387,
  "Rc6+": 1388,
  "Rc7": 1389,
  "Rc7#": 1390,
  "Rc7+": 1391,
  "Rc8": 1392,
  "Rc8#": 1393,
  "Rc8+": 1394,
  "Rca1": 1395,
  "Rcb1": 1396,
  "Rcb2": 1397,
  "Rcb4": 1398,
  "Rcb8": 1399,
  "Rcc1": 1400,
  "Rcc2": 1401,
  "Rcc3": 1402,
  "Rcc4": 1403,
  "Rcc5": 1404,
  "Rcc6": 1405,
  "Rcc7": 1406,
  "Rcc8": 1407,
  "Rcd1": 1408,
  "Rcd2": 1409,
  "Rcd4": 1410,
  "Rcd5": 1411,
  "Rcd6": 1412,
  "Rcd7": 1413,
  "Rcd8": 1414,
  "Rce1": 1415,
  "Rce2": 1416,
  "Rce3": 1417,
  "Rce6": 1418,
  "Rce7": 1419,
  "Rce8": 1420,
  "Rcf1": 1421,
  "Rcf2": 1422,
  "Rcf8": 1423,
  "Rcg1": 1424,
  "Rcg2+": 1425,
  "Rcg7+": 1426,
  "Rch1": 1427,
  "Rcxc1": 1428,
  "Rcxc2": 1429,
  "Rcxc3": 1430,
  "Rcxc7": 1431,
  "Rd1": 1432,
  "Rd1#": 1433,
  "Rd1+": 1434,
  "Rd2": 1435,
  "Rd2#": 1436,
  "Rd2+": 1437,
  "Rd3": 1438,
  "Rd3#": 1439,
  "Rd3+": 1440,
  "Rd4": 1441,
  "Rd4#": 1442,
  "Rd4+": 1443,
  "Rd5": 1444,
  "Rd5#": 1445,
  "Rd5+": 1446,
  "Rd6": 1447,
  "Rd6#": 1448,
  "Rd6+": 1449,
  "Rd7": 1450,
  "Rd7#": 1451,
  "Rd7+": 1452,
  "Rd8": 1453,
  "Rd8#": 1454,
  "Rd8+": 1455,
  "Rda1": 1456,
  "Rda8": 1457,
  "Rdb1": 1458,
  "Rdb8": 1459,
  "Rdc1": 1460,
  "Rdc2": 1461,
  "Rdc7": 1462,
  "Rdc8": 1463,
  "Rdd1": 1464,
  "Rdd2": 1465,
  "Rdd3": 1466,
  "Rdd4": 1467,
  "Rdd5": 1468,
  "Rdd6": 1469,
  "Rdd7": 1470,
  "Rdd8": 1471,
  "Rde1": 1472,
  "Rde1+": 1473,
  "Rde2": 1474,
  "Rde3": 1475,
  "Rde4": 1476,
  "Rde5": 1477,
  "Rde6": 1478,
  "Rde7": 1479,
  "Rde8": 1480,
  "Rde8+": 1481,
  "Rdf1": 1482,
  "Rdf2": 1483,
  "Rdf7": 1484,
  "Rdf8": 1485,
  "Rdg1": 1486,
  "Rdg8": 1487,
  "Rdg8+": 1488,
  "Rdh1": 1489,
  "Rdh8": 1490,
  "Rdxd3": 1491,
  "Rdxd4": 1492,
  "Rdxd5": 1493,
  "Rdxd6": 1494,
  "Rdxd7": 1495,
  "Rdxf7": 1496,
  "Re1": 1497,
  "Re1#": 1498,
  "Re1+": 1499,
  "Re2": 1500,
  "Re2#": 1501,
  "Re2+": 1502,
  "Re3": 1503,
  "Re3#": 1504,
  "Re3+": 1505,
  "Re4": 1506,
  "Re4#": 1507,
  "Re4+": 1508,
  "Re5": 1509,
  "Re5#": 1510,
  "Re5+": 1511,
  "Re6": 1512,
  "Re6+": 1513,
  "Re7": 1514,
  "Re7#": 1515,
  "Re7+": 1516,
  "Re8": 1517,
  "Re8#": 1518,
  "Re8+": 1519,
  "Rea1": 1520,
  "Rea7": 1521,
  "Rea8": 1522,
  "Reb1": 1523,
  "Reb2": 1524,
  "Reb8": 1525,
  "Rec1": 1526,
  "Rec2": 1527,
  "Rec3": 1528,
  "Rec6": 1529,
  "Rec7": 1530,
  "Rec8": 1531,
  "Red1": 1532,
  "Red2": 1533,
  "Red2+": 1534,
  "Red3": 1535,
  "Red4": 1536,
  "Red6": 1537,
  "Red7": 1538,
  "Red8": 1539,
  "Ree1": 1540,
  "Ree2": 1541,
  "Ree3": 1542,
  "Ree4": 1543,
  "Ree5": 1544,
  "Ree6": 1545,
  "Ree7": 1546,
  "Ree8": 1547,
  "Ref1": 1548,
  "Ref2": 1549,
  "Ref3": 1550,
  "Ref6": 1551,
  "Ref7": 1552,
  "Ref8": 1553,
  "Reg1": 1554,
  "Reg8": 1555,
  "Reh1": 1556,
  "Reh8": 1557,
  "Rexd1": 1558,
  "Rexd8": 1559,
  "Rexe2": 1560,
  "Rexe6": 1561,
  "Rexe7": 1562,
  "Rexe7+": 1563,
  "Rf1": 1564,
  "Rf1#": 1565,
  "Rf1+": 1566,
  "Rf2": 1567,
  "Rf2#": 1568,
  "Rf2+": 1569,
  "Rf3": 1570,
  "Rf3#": 1571,
  "Rf3+": 1572,
  "Rf4": 1573,
  "Rf4#": 1574,
  "Rf4+": 1575,
  "Rf5": 1576,
  "Rf5#": 1577,
  "Rf5+": 1578,
  "Rf6": 1579,
  "Rf6#": 1580,
  "Rf6+": 1581,
  "Rf7": 1582,
  "Rf7#": 1583,
  "Rf7+": 1584,
  "Rf8": 1585,
  "Rf8#": 1586,
  "Rf8+": 1587,
  "Rfa1": 1588,
  "Rfa8": 1589,
  "Rfb1": 1590,
  "Rfb8": 1591,
  "Rfc1": 1592,
  "Rfc1+": 1593,
  "Rfc7": 1594,
  "Rfc8": 1595,
  "Rfd1": 1596,
  "Rfd1+": 1597,
  "Rfd2": 1598,
  "Rfd3": 1599,
  "Rfd6": 1600,
  "Rfd7": 1601,
  "Rfd8": 1602,
  "Rfd8+": 1603,
  "Rfe1": 1604,
  "Rfe1+": 1605,
  "Rfe2": 1606,
  "Rfe3": 1607,
  "Rfe7": 1608,
  "Rfe8": 1609,
  "Rfe8+": 1610,
  "Rff1": 1611,
  "Rff2": 1612,
  "Rff3": 1613,
  "Rff4": 1614,
  "Rff5": 1615,
  "Rff6": 1616,
  "Rff7": 1617,
  "Rff8": 1618,
  "Rfg1": 1619,
  "Rfg7": 1620,
  "Rfg7+": 1621,
  "Rfg8": 1622,
  "Rfh1": 1623,
  "Rfh8": 1624,
  "Rfxc1": 1625,
  "Rfxc8": 1626,
  "Rfxd1": 1627,
  "Rfxd8": 1628,
  "Rfxe1": 1629,
  "Rfxf2": 1630,
  "Rfxf3": 1631,
  "Rfxf7": 1632,
  "Rg1": 1633,
  "Rg1#": 1634,
  "Rg1+": 1635,
  "Rg2": 1636,
  "Rg2+": 1637,
  "Rg3": 1638,
  "Rg3+": 1639,
  "Rg4": 1640,
  "Rg4+": 1641,
  "Rg5": 1642,
  "Rg5+": 1643,
  "Rg6": 1644,
  "Rg6+": 1645,
  "Rg7": 1646,
  "Rg7+": 1647,
  "Rg8": 1648,
  "Rg8#": 1649,
  "Rg8+": 1650,
  "Rgb1": 1651,
  "Rgb8": 1652,
  "Rgc1": 1653,
  "Rgc8": 1654,
  "Rgd1": 1655,
  "Rgd6": 1656,
  "Rgd7": 1657,
  "Rgd8": 1658,
  "Rge1": 1659,
  "Rge8": 1660,
  "Rgf1": 1661,
  "Rgf2": 1662,
  "Rgf2+": 1663,
  "Rgf4": 1664,
  "Rgf5": 1665,
  "Rgf7": 1666,
  "Rgf8": 1667,
  "Rgf8+": 1668,
  "Rgg1": 1669,
  "Rgg2": 1670,
  "Rgg3": 1671,
  "Rgg6": 1672,
  "Rgg7": 1673,
  "Rgg8": 1674,
  "Rgh1": 1675,
  "Rgh2": 1676,
  "Rgh8": 1677,
  "Rgxg2": 1678,
  "Rh1": 1679,
  "Rh1#": 1680,
  "Rh1+": 1681,
  "Rh2": 1682,
  "Rh2#": 1683,
  "Rh2+": 1684,
  "Rh3": 1685,
  "Rh3#": 1686,
  "Rh3+": 1687,
  "Rh4": 1688,
  "Rh4#": 1689,
  "Rh4+": 1690,
  "Rh5": 1691,
  "Rh5#": 1692,
  "Rh5+": 1693,
  "Rh6": 1694,
  "Rh6#": 1695,
  "Rh6+": 1696,
  "Rh7": 1697,
  "Rh7#": 1698,
  "Rh7+": 1699,
  "Rh8": 1700,
  "Rh8#": 1701,
  "Rh8+": 1702,
  "Rha1": 1703,
  "Rha8": 1704,
  "Rhb1": 1705,
  "Rhb8": 1706,
  "Rhc1": 1707,
  "Rhc2": 1708,
  "Rhc8": 1709,
  "Rhd1": 1710,
  "Rhd1+": 1711,
  "Rhd8": 1712,
  "Rhe1": 1713,
  "Rhe1+": 1714,
  "Rhe2": 1715,
  "Rhe3": 1716,
  "Rhe5": 1717,
  "Rhe6": 1718,
  "Rhe8": 1719,
  "Rhe8+": 1720,
  "Rhf1": 1721,
  "Rhf1+": 1722,
  "Rhf2": 1723,
  "Rhf4": 1724,
  "Rhf7": 1725,
  "Rhf8": 1726,
  "Rhg1": 1727,
  "Rhg1+": 1728,
  "Rhg2+": 1729,
  "Rhg7": 1730,
  "Rhg7+": 1731,
  "Rhg8": 1732,
  "Rhg8+": 1733,
  "Rhh1": 1734,
  "Rhh2": 1735,
  "Rhh3": 1736,
  "Rhh5": 1737,
  "Rhh7": 1738,
  "Rhh8": 1739,
  "Rhxd8": 1740,
  "Rhxf1": 1741,
  "Rhxg8": 1742,
  "Rxa1": 1743,
  "Rxa1+": 1744,
  "Rxa2": 1745,
  "Rxa2+": 1746,
  "Rxa3": 1747,
  "Rxa3+": 1748,
  "Rxa4": 1749,
  "Rxa4+": 1750,
  "Rxa5": 1751,
  "Rxa5+": 1752,
  "Rxa6": 1753,
  "Rxa6+": 1754,
  "Rxa7": 1755,
  "Rxa7+": 1756,
  "Rxa8": 1757,
  "Rxa8+": 1758,
  "Rxb1": 1759,
  "Rxb1#": 1760,
  "Rxb1+": 1761,
  "Rxb2": 1762,
  "Rxb2+": 1763,
  "Rxb3": 1764,
  "Rxb3+": 1765,
  "Rxb4": 1766,
  "Rxb4+": 1767,
  "Rxb5": 1768,
  "Rxb5+": 1769,
  "Rxb6": 1770,
  "Rxb6+": 1771,
  "Rxb7": 1772,
  "Rxb7+": 1773,
  "Rxb8": 1774,
  "Rxb8+": 1775,
  "Rxc1": 1776,
  "Rxc1#": 1777,
  "Rxc1+": 1778,
  "Rxc2": 1779,
  "Rxc2+": 1780,
  "Rxc3": 1781,
  "Rxc3+": 1782,
  "Rxc4": 1783,
  "Rxc4+": 1784,
  "Rxc5": 1785,
  "Rxc5+": 1786,
  "Rxc6": 1787,
  "Rxc6+": 1788,
  "Rxc7": 1789,
  "Rxc7+": 1790,
  "Rxc8": 1791,
  "Rxc8#": 1792,
  "Rxc8+": 1793,
  "Rxd1": 1794,
  "Rxd1#": 1795,
  "Rxd1+": 1796,
  "Rxd2": 1797,
  "Rxd2+": 1798,
  "Rxd3": 1799,
  "Rxd3+": 1800,
  "Rxd4": 1801,
  "Rxd4+": 1802,
  "Rxd5": 1803,
  "Rxd5+": 1804,
  "Rxd6": 1805,
  "Rxd6+": 1806,
  "Rxd7": 1807,
  "Rxd7+": 1808,
  "Rxd8": 1809,
  "Rxd8#": 1810,
  "Rxd8+": 1811,
  "Rxe1": 1812,
  "Rxe1#": 1813,
  "Rxe1+": 1814,
  "Rxe2": 1815,
  "Rxe2+": 1816,
  "Rxe3": 1817,
  "Rxe3+": 1818,
  "Rxe4": 1819,
  "Rxe4+": 1820,
  "Rxe5": 1821,
  "Rxe5+": 1822,
  "Rxe6": 1823,
  "Rxe6+": 1824,
  "Rxe7": 1825,
  "Rxe7+": 1826,
  "Rxe8": 1827,
  "Rxe8#": 1828,
  "Rxe8+": 1829,
  "Rxf1": 1830,
  "Rxf1#": 1831,
  "Rxf1+": 1832,
  "Rxf2": 1833,
  "Rxf2#": 1834,
  "Rxf2+": 1835,
  "Rxf3": 1836,
  "Rxf3#": 1837,
  "Rxf3+": 1838,
  "Rxf4": 1839,
  "Rxf4+": 1840,
  "Rxf5": 1841,
  "Rxf5+": 1842,
  "Rxf6": 1843,
  "Rxf6+": 1844,
  "Rxf7": 1845,
  "Rxf7+": 1846,
  "Rxf8": 1847,
  "Rxf8#": 1848,
  "Rxf8+": 1849,
  "Rxg1": 1850,
  "Rxg1#": 1851,
  "Rxg1+": 1852,
  "Rxg2": 1853,
  "Rxg2+": 1854,
  "Rxg3": 1855,
  "Rxg3+": 1856,
  "Rxg4": 1857,
  "Rxg4+": 1858,
  "Rxg5": 1859,
  "Rxg5+": 1860,
  "Rxg6": 1861,
  "Rxg6+": 1862,
  "Rxg7": 1863,
  "Rxg7+": 1864,
  "Rxg8": 1865,
  "Rxg8#": 1866,
  "Rxg8+": 1867,
  "Rxh1": 1868,
  "Rxh1+": 1869,
  "Rxh2": 1870,
  "Rxh2#": 1871,
  "Rxh2+": 1872,
  "Rxh3": 1873,
  "Rxh3#": 1874,
  "Rxh3+": 1875,
  "Rxh4": 1876,
  "Rxh4#": 1877,
  "Rxh4+": 1878,
  "Rxh5": 1879,
  "Rxh5#": 1880,
  "Rxh5+": 1881,
  "Rxh6": 1882,
  "Rxh6#": 1883,
  "Rxh6+": 1884,
  "Rxh7": 1885,
  "Rxh7#": 1886,
  "Rxh7+": 1887,
  "Rxh8": 1888,
  "Rxh8+": 1889,
  "a1=Q": 1890,
  "a1=Q#": 1891,
  "a1=Q+": 1892,
  "a2": 1893,
  "a2+": 1894,
  "a3": 1895,
  "a3+": 1896,
  "a4": 1897,
  "a4+": 1898,
  "a5": 1899,
  "a5+": 1900,
  "a6": 1901,
  "a6+": 1902,
  "a7": 1903,
  "a7+": 1904,
  "a8=Q": 1905,
  "a8=Q#": 1906,
  "a8=Q+": 1907,
  "axb1=Q": 1908,
  "axb2": 1909,
  "axb2+": 1910,
  "axb3": 1911,
  "axb3+": 1912,
  "axb4": 1913,
  "axb4+": 1914,
  "axb5": 1915,
  "axb5+": 1916,
  "axb6": 1917,
  "axb6+": 1918,
  "axb7": 1919,
  "axb7+": 1920,
  "b1=Q": 1921,
  "b1=Q+": 1922,
  "b2": 1923,
  "b2+": 1924,
  "b3": 1925,
  "b3+": 1926,
  "b4": 1927,
  "b4+": 1928,
  "b5": 1929,
  "b5+": 1930,
  "b6": 1931,
  "b6+": 1932,
  "b7": 1933,
  "b7+": 1934,
  "b8=Q": 1935,
  "b8=Q+": 1936,
  "bxa1=Q": 1937,
  "bxa2": 1938,
  "bxa3": 1939,
  "bxa3+": 1940,
  "bxa4": 1941,
  "bxa4+": 1942,
  "bxa5": 1943,
  "bxa5+": 1944,
  "bxa6": 1945,
  "bxa7": 1946,
  "bxa8=Q": 1947,
  "bxc2": 1948,
  "bxc3": 1949,
  "bxc3+": 1950,
  "bxc4": 1951,
  "bxc4+": 1952,
  "bxc5": 1953,
  "bxc5+": 1954,
  "bxc6": 1955,
  "bxc6+": 1956,
  "bxc7": 1957,
  "c1=Q": 1958,
  "c1=Q#": 1959,
  "c1=Q+": 1960,
  "c2": 1961,
  "c2+": 1962,
  "c3": 1963,
  "c3+": 1964,
  "c4": 1965,
  "c4+": 1966,
  "c5": 1967,
  "c5+": 1968,
  "c6": 1969,
  "c6+": 1970,
  "c7": 1971,
  "c7+": 1972,
  "c8=Q": 1973,
  "c8=Q#": 1974,
  "c8=Q+": 1975,
  "c8=R": 1976,
  "cxb2": 1977,
  "cxb2+": 1978,
  "cxb3": 1979,
  "cxb3+": 1980,
  "cxb4": 1981,
  "cxb4+": 1982,
  "cxb5": 1983,
  "cxb5+": 1984,
  "cxb6": 1985,
  "cxb6+": 1986,
  "cxb7": 1987,
  "cxb7+": 1988,
  "cxd2": 1989,
  "cxd2+": 1990,
  "cxd3": 1991,
  "cxd3+": 1992,
  "cxd4": 1993,
  "cxd4+": 1994,
  "cxd5": 1995,
  "cxd5+": 1996,
  "cxd6": 1997,
  "cxd6+": 1998,
  "cxd7": 1999,
  "cxd7+": 2000,
  "cxd8=Q": 2001,
  "cxd8=Q+": 2002,
  "d1=Q": 2003,
  "d1=Q+": 2004,
  "d2": 2005,
  "d2+": 2006,
  "d3": 2007,
  "d3+": 2008,
  "d4": 2009,
  "d4+": 2010,
  "d5": 2011,
  "d5+": 2012,
  "d6": 2013,
  "d6+": 2014,
  "d7": 2015,
  "d7+": 2016,
  "d8=N": 2017,
  "d8=Q": 2018,
  "d8=Q#": 2019,
  "d8=Q+": 2020,
  "dxc2": 2021,
  "dxc3": 2022,
  "dxc3+": 2023,
  "dxc4": 2024,
  "dxc4+": 2025,
  "dxc5": 2026,
  "dxc5+": 2027,
  "dxc6": 2028,
  "dxc6+": 2029,
  "dxc7": 2030,
  "dxc7+": 2031,
  "dxc8=Q+": 2032,
  "dxe1=Q": 2033,
  "dxe2": 2034,
  "dxe3": 2035,
  "dxe3+": 2036,
  "dxe4": 2037,
  "dxe4+": 2038,
  "dxe5": 2039,
  "dxe5+": 2040,
  "dxe6": 2041,
  "dxe6+": 2042,
  "dxe7": 2043,
  "dxe8=Q+": 2044,
  "e1=Q": 2045,
  "e1=Q+": 2046,
  "e2": 2047,
  "e2+": 2048,
  "e3": 2049,
  "e3+": 2050,
  "e4": 2051,
  "e4+": 2052,
  "e5": 2053,
  "e5+": 2054,
  "e6": 2055,
  "e6+": 2056,
  "e7": 2057,
  "e7+": 2058,
  "e8=Q": 2059,
  "e8=Q#": 2060,
  "e8=Q+": 2061,
  "exd2": 2062,
  "exd2+": 2063,
  "exd3": 2064,
  "exd3+": 2065,
  "exd4": 2066,
  "exd4+": 2067,
  "exd5": 2068,
  "exd5+": 2069,
  "exd6": 2070,
  "exd6+": 2071,
  "exd7": 2072,
  "exd7+": 2073,
  "exf1=Q+": 2074,
  "exf2": 2075,
  "exf2+": 2076,
  "exf3": 2077,
  "exf3+": 2078,
  "exf4": 2079,
  "exf4+": 2080,
  "exf5": 2081,
  "exf5+": 2082,
  "exf6": 2083,
  "exf6+": 2084,
  "exf7": 2085,
  "exf7+": 2086,
  "exf8=Q+": 2087,
  "f1=Q": 2088,
  "f1=Q+": 2089,
  "f2": 2090,
  "f2+": 2091,
  "f3": 2092,
  "f3+": 2093,
  "f4": 2094,
  "f4#": 2095,
  "f4+": 2096,
  "f5": 2097,
  "f5+": 2098,
  "f6": 2099,
  "f6+": 2100,
  "f7": 2101,
  "f7+": 2102,
  "f8=Q": 2103,
  "f8=Q#": 2104,
  "f8=Q+": 2105,
  "fxe2": 2106,
  "fxe3": 2107,
  "fxe3+": 2108,
  "fxe4": 2109,
  "fxe4+": 2110,
  "fxe5": 2111,
  "fxe5+": 2112,
  "fxe6": 2113,
  "fxe6+": 2114,
  "fxe7": 2115,
  "fxg2": 2116,
  "fxg2+": 2117,
  "fxg3": 2118,
  "fxg3+": 2119,
  "fxg4": 2120,
  "fxg4+": 2121,
  "fxg5": 2122,
  "fxg5+": 2123,
  "fxg6": 2124,
  "fxg6+": 2125,
  "fxg7": 2126,
  "fxg7+": 2127,
  "g1=Q": 2128,
  "g1=Q#": 2129,
  "g1=Q+": 2130,
  "g1=R": 2131,
  "g2": 2132,
  "g2+": 2133,
  "g3": 2134,
  "g3#": 2135,
  "g3+": 2136,
  "g4": 2137,
  "g4#": 2138,
  "g4+": 2139,
  "g5": 2140,
  "g5#": 2141,
  "g5+": 2142,
  "g6": 2143,
  "g6#": 2144,
  "g6+": 2145,
  "g7": 2146,
  "g7+": 2147,
  "g8=Q": 2148,
  "g8=Q#": 2149,
  "g8=Q+": 2150,
  "gxf1=Q+": 2151,
  "gxf2": 2152,
  "gxf2+": 2153,
  "gxf3": 2154,
  "gxf3+": 2155,
  "gxf4": 2156,
  "gxf4+": 2157,
  "gxf5": 2158,
  "gxf5+": 2159,
  "gxf6": 2160,
  "gxf6+": 2161,
  "gxf7": 2162,
  "gxf7+": 2163,
  "gxh2": 2164,
  "gxh2+": 2165,
  "gxh3": 2166,
  "gxh3+": 2167,
  "gxh4": 2168,
  "gxh4+": 2169,
  "gxh5": 2170,
  "gxh5+": 2171,
  "gxh6": 2172,
  "gxh6+": 2173,
  "gxh7": 2174,
  "gxh7+": 2175,
  "h1=Q": 2176,
  "h1=Q#": 2177,
  "h1=Q+": 2178,
  "h2": 2179,
  "h2+": 2180,
  "h3": 2181,
  "h3#": 2182,
  "h3+": 2183,
  "h4": 2184,
  "h4+": 2185,
  "h5": 2186,
  "h5+": 2187,
  "h6": 2188,
  "h6#": 2189,
  "h6+": 2190,
  "h7": 2191,
  "h7+": 2192,
  "h8=Q": 2193,
  "h8=Q#": 2194,
  "h8=Q+": 2195,
  "hxg2": 2196,
  "hxg3": 2197,
  "hxg3+": 2198,
  "hxg4": 2199,
  "hxg4+": 2200,
  "hxg5": 2201,
  "hxg5+": 2202,
  "hxg6": 2203,
  "hxg6+": 2204,
  "hxg7": 2205,
  "hxg7+": 2206
}