{
  "d4": 4,
  "d5": 5,
  "c4": 6,
  "c6": 7,
  "cxd5": 8,
  "e6": 9,
  "dxe6": 10,
  "fxe6": 11,
  "Nf3": 12,
  "Bb4+": 13,
  "Nc3": 14,
  "Ba5": 15,
  "Bf4": 16,
  "Nc6": 17,
  "e4": 18,
  "e5": 19,
  "f4": 20,
  "f6": 21,
  "dxe5": 22,
  "fxe5": 23,
  "Nxe5": 24,
  "Qd4": 25,
  "Qe5+": 26,
  "d3": 27,
  "d6": 28,
  "Be3": 29,
  "Be2": 30,
  "b5": 31,
  "Nd2": 32,
  "a5": 33,
  "a4": 34,
  "c5": 35,
  "axb5": 36,
  "bxc6": 37,
  "Ra6": 38,
  "Nc4": 39,
  "c3": 40,
  "a3": 41,
  "Nxa3": 42,
  "Rxa3": 43,
  "dxc4": 44,
  "Qxd5": 45,
  "exd5": 46,
  "Be6": 47,
  "Ra8+": 48,
  "Ke7": 49,
  "Bc5+": 50,
  "Kf6": 51,
  "Bxf8": 52,
  "Kg6": 53,
  "Bxg7": 54,
  "Kxg7": 55,
  "Kh6": 56,
  "exf7": 57,
  "Nf6": 58,
  "Rxh8": 59,
  "Nh5": 60,
  "Bxh5": 61,
  "Kg5": 62,
  "Rxh7": 63,
  "Kf5": 64,
  "Qf3+": 65,
  "Ke6": 66,
  "Bg4+": 67,
  "Kd6": 68,
  "Rh6+": 69,
  "Kc5": 70,
  "Qe3+": 71,
  "Kb5": 72,
  "c4+": 73,
  "Kb4": 74,
  "Qc3+": 75,
  "Ka4": 76,
  "Bf5": 78,
  "Ng4": 79,
  "e3": 80,
  "Qd7": 81,
  "O-O": 82,
  "O-O-O": 83,
  "Nb5": 84,
  "Nb4": 85,
  "Rc1": 86,
  "Nxa2": 87,
  "Ra1": 88,
  "Nxa7+": 89,
  "Kb8": 90,
  "Bxc2": 91,
  "Bxc7+": 92,
  "Kc8": 93,
  "Qd2": 94,
  "Qc6": 95,
  "Na7+": 96,
  "Kd7": 97,
  "Nxc6": 98,
  "Bxd8": 99,
  "Kxd8": 100,
  "Qxb4": 101,
  "Qb8+": 102,
  "Be4": 103,
  "Ra7+": 104,
  "Qe8+": 105,
  "Qxf7+": 106,
  "Nh4+": 107,
  "g3": 108,
  "Qf4+": 109,
  "Kh5": 110,
  "Qxg4+": 111,
  "g5": 112,
  "Qf6+": 113,
  "Bg6": 114,
  "Nxg6": 115,
  "Bg7": 116,
  "Qxg7#": 117,
  "Na6": 118,
  "Be7": 119,
  "b4": 120,
  "Bg5": 121,
  "Nc5": 122,
  "Bxf6": 123,
  "Bd3": 124,
  "Nxd3": 125,
  "Qxd3": 126,
  "Nxd5": 127,
  "Qe6": 128,
  "Nc7": 129,
  "Qg4": 130,
  "Nxa8": 131,
  "Bd7": 132,
  "Rc8": 133,
  "Nd5": 134,
  "Qg6": 135,
  "Nxf6+": 136,
  "Qxf6": 137,
  "Rfd1": 138,
  "Re8": 139,
  "Qxd6": 140,
  "Bg4": 141,
  "gxf6": 142,
  "Rd3": 143,
  "Bxf3": 144,
  "Rxf3": 145,
  "Rd8": 146,
  "Rxf6": 147,
  "Kg7": 148,
  "Rf3": 149,
  "Rd2": 150,
  "Rg3+": 151,
  "Kf8": 152,
  "Re2": 153,
  "f3": 154,
  "Rc2": 155,
  "Rg5": 156,
  "Rh5": 157,
  "Rd1": 158,
  "Rh3": 159,
  "Rxc3": 160,
  "Rd7": 161,
  "Rc1+": 162,
  "Kf2": 163,
  "Rc2+": 164,
  "Kg3": 165,
  "h5": 166,
  "Rxb7": 167,
  "Rxa7": 168,
  "h4+": 169,
  "Rxh4": 170,
  "Rxg2+": 171,
  "Kxg2": 172,
  "Kxh4": 173,
  "b6": 174,
  "b7": 175,
  "f5": 176,
  "exf5": 177,
  "Kxf5": 178,
  "b8=Q": 179,
  "Rf7+": 180,
  "Qg8+": 181,
  "Rh7#": 182,
  "Qa5": 183,
  "dxe4": 184,
  "exf3": 185,
  "Nxf3": 186,
  "Bb5": 187,
  "a6": 188,
  "Nxd4": 189,
  "Nxe2+": 190,
  "Qxe2": 191,
  "Qxf3": 192,
  "Qd4+": 193,
  "Qxb7": 194,
  "Qc6+": 195,
  "Nd7": 196,
  "Nxc7+": 197,
  "Bd2": 198,
  "Nce7": 199,
  "Ng6": 200,
  "Bc4": 201,
  "Nd4": 202,
  "Nxf3+": 203,
  "h3": 204,
  "Bc5": 205,
  "Bxe3": 206,
  "Qxe3": 207,
  "Qf3": 208,
  "Bb3": 209,
  "Bb7": 210,
  "Ne2": 211,
  "bxc4": 212,
  "Rac8": 213,
  "Rd5": 214,
  "Bxd5": 215,
  "Qb6": 216,
  "Nc1": 217,
  "Qf4": 218,
  "Bc2": 219,
  "Qe1+": 220,
  "Kh2": 221,
  "Qxf2": 222,
  "Bxe4": 223,
  "Rxe4": 224,
  "Nd3": 225,
  "Qg3+": 226,
  "Kg1": 227,
  "Rf1": 228,
  "Rce8": 229,
  "Kh1": 230,
  "Ng3+": 231,
  "Nxf1+": 232,
  "Qf5": 233,
  "Bxa6": 234,
  "bxa6": 235,
  "Qe6+": 236,
  "Ng5": 237,
  "Qc4": 238,
  "Qh5": 239,
  "Bxg2": 240,
  "Qxf7": 241,
  "Nxf7": 242,
  "Kxf7": 243,
  "Rg1": 244,
  "Bf3": 245,
  "Rg3": 246,
  "Bh5": 247,
  "g6": 248,
  "Ne4": 249,
  "Nxa6": 250,
  "Bxb4+": 251,
  "Bc7": 252,
  "Bxc7": 253,
  "Rxc7": 254,
  "Rb1": 255,
  "Rd2+": 256,
  "Rxa2": 257,
  "exf6": 258,
  "Kxf6": 259,
  "Rxg4": 260,
  "Rg2": 261,
  "Re2+": 262,
  "Kf3": 263,
  "Re4": 264,
  "Rxf4+": 265,
  "Rg4+": 266,
  "Kh3": 267,
  "Rf4": 268,
  "Rxf4": 269,
  "gxf4": 270,
  "Kg2": 271,
  "h4": 272,
  "cxb5": 273,
  "Kg4": 274,
  "f3+": 275,
  "Kf4": 276,
  "b8=Q+": 277,
  "Ke4": 278,
  "Qb4+": 279,
  "Kd5": 280,
  "Kxf3": 281,
  "Ke5": 282,
  "Qe4": 283,
  "Kh7": 284,
  "Qg5": 285,
  "Kh8": 286,
  "Qg7#": 287,
  "Qe2": 288,
  "dxc5": 289,
  "Rfe1": 290,
  "Bc6": 291,
  "Rad1": 292,
  "Qb7": 293,
  "Bxe7": 294,
  "Rxe7": 295,
  "Rd8+": 296,
  "Red1": 297,
  "Bd5": 298,
  "Rxe8#": 299,
  "Qxb2": 300,
  "Nbd2": 301,
  "cxd4": 302,
  "Qxa2": 303,
  "Qb3": 304,
  "Qxb3": 305,
  "Nxb3": 306,
  "Nc2+": 307,
  "Kd1": 308,
  "Nxe3+": 309,
  "fxe3": 310,
  "Ne7": 311,
  "Nf5": 312,
  "Nxe4": 313,
  "Ne3+": 314,
  "Ke2": 315,
  "Nxf1": 316,
  "Rhxf1": 317,
  "Ned2": 318,
  "Ba6+": 319,
  "Qe2+": 320,
  "g4": 321,
  "Bxg4": 322,
  "Bg2": 323,
  "Nbd7": 324,
  "Bd6": 325,
  "Nb6": 326,
  "h6": 327,
  "b3": 328,
  "Nxe3": 329,
  "Nd1": 330,
  "Bb4": 331,
  "Qc7": 332,
  "Bxc3": 333,
  "Qxc3": 334,
  "Qg3": 335,
  "Re6": 336,
  "Rf6": 337,
  "Re3": 338,
  "Rg6": 339,
  "Ra2": 340,
  "Qe5": 341,
  "Qb5+": 342,
  "Qe3": 343,
  "Nef6": 344,
  "Qf2": 345,
  "Nf4": 346,
  "Nxd3+": 347,
  "cxd3": 348,
  "Bxd4": 349,
  "Ne8": 350,
  "Bxh6": 351,
  "Ne1": 352,
  "Re7": 353,
  "Bxe6": 354,
  "Rxe6": 355,
  "Qg4+": 356,
  "Qe7": 357,
  "Re1": 358,
  "Qh4": 359,
  "Qd8": 360,
  "Nec3": 361,
  "Nd8": 362,
  "Bxd5+": 363,
  "Qxd5+": 364,
  "hxg5": 365,
  "Qxg5": 366,
  "Qxf3+": 367,
  "Qg2": 368,
  "Qd1+": 369,
  "Qf1": 370,
  "Bh6": 371,
  "Kxf8": 372,
  "bxc3": 373,
  "Bxd1": 374,
  "Bxf1": 375,
  "Kxf1": 376,
  "Nxg4": 377,
  "Nh2+": 378,
  "Kxh2": 379,
  "Nxd8": 380,
  "Rxd8": 381,
  "Qd1": 382,
  "Bh3": 383,
  "Qxf1": 384,
  "Nxc7": 385,
  "Qc8": 386,
  "Qxa8": 387,
  "cxd6": 388,
  "Nxd6": 389,
  "Ne6": 390,
  "Qe1": 391,
  "Bxc4": 392,
  "Qxc4": 393,
  "Ba3": 394,
  "Rxd2": 395,
  "Qxe4+": 396,
  "Kf1": 397,
  "Qxf2+": 398,
  "Qxh2#": 399,
  "Qd5": 400,
  "Rb8": 401,
  "Qxa7": 402,
  "Qc2": 403,
  "Rab1": 404,
  "Rec1": 405,
  "Qd3": 406,
  "Rfd8": 407,
  "bxc5": 408,
  "Rxb8": 409,
  "Qa8+": 410,
  "Bf8": 411,
  "Qa4": 412,
  "Rxd1+": 413,
  "Qxd1": 414,
  "Qd6": 415,
  "Bxf4": 416,
  "Qxf4": 417,
  "Qxd7": 418,
  "Qxe1": 419,
  "Qf5+": 420,
  "Kg8": 421,
  "Qd5+": 422,
  "Qxc5": 423,
  "e2": 424,
  "Qe4+": 425,
  "e1=Q": 426,
  "Qa1": 427,
  "Qxa6": 428,
  "d7": 429,
  "Qa8": 430,
  "Ba4": 431,
  "Na5": 432,
  "Bxa8": 433,
  "Nxf2": 434,
  "Nxe6": 435,
  "Nge7": 436,
  "Nxe7+": 437,
  "Qxe7": 438,
  "Bxb7": 439,
  "Qe8": 440,
  "Qxd4": 441,
  "Bb5+": 442,
  "Bxd3": 443,
  "Qf6": 444,
  "hxg4": 445,
  "Qh6": 446,
  "Na4": 447,
  "Nb7": 448,
  "Nd6": 449,
  "Ne5": 450,
  "Ndxf7": 451,
  "Rxf7": 452,
  "fxg5+": 453,
  "gxh6+": 454,
  "Kxh6": 455,
  "Rf6+": 456,
  "Qg6+": 457,
  "Qxh6+": 458,
  "Kf7": 459,
  "Re8+": 460,
  "Rxe8": 461,
  "Qh6+": 462,
  "Nxc2": 463,
  "Qh7#": 464,
  "exd4": 465,
  "dxc3": 466,
  "Bxf7+": 467,
  "Ke8": 468,
  "Qxe7+": 469,
  "Ncxe7": 470,
  "Nxc3": 471,
  "Bf7": 472,
  "Rxa8": 473,
  "Ba6": 474,
  "Rxd5": 475,
  "Bxc3+": 476,
  "Rh2": 477,
  "Qb5": 478,
  "Nxh2": 479,
  "Kd2": 480,
  "Nf3+": 481,
  "Kc3": 482,
  "Qb8": 483,
  "Qxc6+": 484,
  "Kd8": 485,
  "exd4+": 486,
  "Kb3": 487,
  "dxe3": 488,
  "Qd7+": 489,
  "Bxd7": 490,
  "Qxb5+": 491,
  "Qc4+": 492,
  "Kb2": 493,
  "Rb8#": 494,
  "Bxd6": 495,
  "Qf8": 496,
  "Qxd8": 497,
  "Qxf5": 498,
  "Qh5+": 499,
  "exf4": 500,
  "Bxc5": 501,
  "Rf7": 502,
  "Bb6": 503,
  "Ba7": 504,
  "Qxa5": 505,
  "exf2+": 506,
  "Rxf2": 507,
  "Re1+": 508,
  "Rxf1#": 509,
  "Rbd1": 510,
  "Nxa5": 511,
  "Nxb5": 512,
  "gxf3": 513,
  "Na7": 514,
  "Nxb2": 515,
  "Rb4": 516,
  "Nxh2+": 517,
  "Nxg5": 518,
  "Bh3+": 520,
  "Kxh3": 522,
  "Nxf2+": 523,
  "Nxd1": 524,
  "Rxd1": 525,
  "Rd4": 526,
  "Rc7": 527,
  "Bxd7+": 528,
  "Nxd7": 529,
  "Ngf6": 530,
  "Bxb2": 531,
  "Qa3": 532,
  "Rxe3": 533,
  "Qc3": 534,
  "Qb4": 535,
  "Rf8": 536,
  "Qa7": 537,
  "Qxb6": 538,
  "Qf2+": 539,
  "Nf2#": 540,
  "Qxe2+": 541,
  "Bxe2": 542,
  "Bxb5": 543,
  "Nxc5": 544,
  "Rad8": 545,
  "Rd6": 546,
  "Rxe8+": 547,
  "Na3": 548,
  "Bxg6": 549,
  "Kb1": 550,
  "cxb3": 551,
  "Bxf5+": 552,
  "Ka1": 553,
  "Bd4": 554,
  "Bxc6": 555,
  "dxc6": 556,
  "Raxd8": 557,
  "Nxb6": 558,
  "Rc5": 559,
  "Qxe5": 560,
  "Nbxd7": 561,
  "Qxe5+": 562,
  "Nge2": 563,
  "Qxe4": 564,
  "Qxc2": 565,
  "Bxd2": 566,
  "Bxc1": 567,
  "Raxc1": 568,
  "bxa7": 569,
  "Rfb1": 570,
  "Qc5+": 571,
  "Ra8": 572,
  "Reb1": 573,
  "Ke1": 574,
  "c2": 575,
  "Rxe5": 576,
  "Qb2": 577,
  "c1=Q+": 578,
  "Kd3": 579,
  "Qa5+": 580,
  "Bxd2+": 581,
  "Nxd2": 582,
  "Qc5": 583,
  "Rxd3": 584,
  "Kc2": 585,
  "Rhd1": 586,
  "Rc6": 587,
  "Rxd6": 588,
  "exd6": 589,
  "gxf5": 590,
  "Neg4": 591,
  "Ndxf3": 592,
  "Nxh7": 593,
  "Rxf1+": 594,
  "Rxf1": 595,
  "Qxg6": 596,
  "Nf7+": 597,
  "Nxe5+": 598,
  "Nc4+": 599,
  "Ng3": 601,
  "Nbc4": 602,
  "Nxc4": 603,
  "Rhe1": 604,
  "Nxg7+": 605,
  "Nxe6+": 606,
  "Nxc7#": 607,
  "Bxf5": 608,
  "Bb2": 609,
  "Qxb8+": 610,
  "Qb7+": 611,
  "Bc8": 612,
  "Qxc6": 613,
  "Qc7+": 614,
  "Qxc8+": 615,
  "Ne5+": 616,
  "Qxe6+": 617,
  "exd3": 619,
  "Be5": 620,
  "Qh3": 621,
  "Rg8": 622,
  "Qa4+": 623,
  "Bf6": 624,
  "Bxa4": 625,
  "Qxa1+": 626,
  "Qxa2+": 627,
  "Qxc7": 628,
  "Qxh2+": 629,
  "Bxa1": 630,
  "Rxa1": 631,
  "Qh1+": 632,
  "Qc8+": 633,
  "Rxc8": 634,
  "Nxa7": 635,
  "Nab5": 636,
  "Nc7+": 637,
  "Qe7+": 638,
  "Bxb4": 639,
  "Qxb4+": 640,
  "Rfb8": 641,
  "Bg3": 642,
  "Bh4": 643,
  "Qb3+": 644,
  "Nd5+": 645,
  "Nxe2": 646,
  "Kxe2": 647,
  "bxa4+": 648,
  "Qxa1": 649,
  "Bc3": 650,
  "Nge4": 651,
  "Bxh2+": 652,
  "Bg3+": 653,
  "Qh2#": 654,
  "Ra3": 655,
  "Nxg3+": 656,
  "fxg3": 657,
  "Nd6+": 658,
  "Rxf8+": 659,
  "Qxf8": 660,
  "Bg5+": 661,
  "Bxc6+": 662,
  "Nf7": 663,
  "Bc1": 664,
  "Rxd4": 665,
  "Rfc8": 666,
  "Rdb8": 667,
  "bxa5": 668,
  "Rh6": 669,
  "Rh8": 670,
  "Rh4": 671,
  "Rab8": 672,
  "Rxb2": 673,
  "Rg4": 674,
  "d2": 675,
  "Rgg1": 676,
  "Rdd3": 677,
  "Rgf1": 678,
  "Rxf3+": 679,
  "Nxh8": 680,
  "fxg4": 681,
  "Qc2+": 682,
  "Rff1": 683,
  "Rf8+": 684,
  "Rxf8": 685,
  "Qg7": 686,
  "Qxg4": 687,
  "Be8": 688,
  "Nd7+": 689,
  "Nfd2": 690,
  "Nh6": 691,
  "Nb3": 692,
  "Bh2": 693,
  "Nxb7": 694,
  "Bxg3": 695,
  "Qxg3+": 696,
  "Qh3+": 697,
  "Qxc7+": 698,
  "Rexd8": 699,
  "Rac1": 700,
  "Rb7": 701,
  "Rf2": 702,
  "Rxc1+": 703,
  "Nf2": 704,
  "Nh3": 705,
  "Ng5+": 706,
  "Rxh4+": 707,
  "Rh7+": 708,
  "Bxg5": 709,
  "Rxg6+": 710,
  "Rxg5": 711,
  "Qh8": 712,
  "Qxh5": 713,
  "Rxh5": 714,
  "Rh7": 716,
  "Rgg8": 717,
  "Rgd8": 718,
  "Rdc8": 719,
  "Rbb7": 720,
  "Rh6#": 721,
  "Nd3+": 722,
  "Qxc3+": 723,
  "Qb2+": 724,
  "Rhb1": 725,
  "Nf4+": 726,
  "Kxd7": 727,
  "Qxf2#": 728,
  "Qxd2": 729,
  "Nxf4": 730,
  "cxb7": 731,
  "Kxd3": 732,
  "Qxa3+": 734,
  "Qa2+": 735,
  "Rb3+": 736,
  "Nbc6": 737,
  "hxg6": 738,
  "Rxe1+": 739,
  "Qxe8+": 740,
  "Kxe8": 741,
  "Rae1": 742,
  "Qxg7": 743,
  "Qxg8+": 744,
  "hxg3": 745,
  "Rfe8": 746,
  "Rb3": 747,
  "Ra7": 748,
  "Rb6": 749,
  "Rcc7": 750,
  "Ra5": 751,
  "Rb5": 752,
  "Rxb5": 753,
  "Kh4": 754,
  "Kxg4": 755,
  "h5+": 756,
  "Ke3": 757,
  "Rc3": 758,
  "gxh4": 759,
  "Kxf4": 760,
  "Rf3+": 761,
  "Rxc5": 762,
  "Rxg6": 763,
  "Rh1": 764,
  "Rg1+": 765,
  "h7": 766,
  "Rh1+": 767,
  "Rh4+": 768,
  "Rf4+": 769,
  "h8=Q": 770,
  "Qd2+": 771,
  "Qg5+": 772,
  "Kd4": 773,
  "Ne3": 774,
  "Nc2": 775,
  "Qb1": 776,
  "Nxe8": 777,
  "Qxe8": 778,
  "Qxc5+": 779,
  "Rxe1": 780,
  "Bxa7": 781,
  "Ree2": 782,
  "Ra1#": 784,
  "Bxe5": 785,
  "Rxa6": 786,
  "Bxh4": 787,
  "axb6": 788,
  "gxh6": 789,
  "Nf6+": 790,
  "Raxd1": 792,
  "Rxf5": 793,
  "Raf8": 794,
  "Rxf7+": 795,
  "Rhe8": 796,
  "fxe4": 797,
  "Nf1": 798,
  "Nc8": 800,
  "Qh2": 802,
  "Rg7": 803,
  "Rff7": 804,
  "Be1": 805,
  "Qxg4#": 806,
  "Nxg3": 807,
  "Kxh8": 808,
  "Qf7+": 809,
  "Qxf8+": 810,
  "Rxc7+": 811,
  "Rxc6": 812,
  "Rdd7": 813,
  "Rxg7": 814,
  "Ba8": 815,
  "Rxh5+": 816,
  "Rg5+": 817,
  "Rg7+": 818,
  "e7": 819,
  "Nd8+": 820,
  "Kxe7": 821,
  "Kc7": 822,
  "Rxb4": 823,
  "Nfe7": 824,
  "Nxf5": 825,
  "Ncxd4": 826,
  "Qh4+": 827,
  "Qxh7+": 828,
  "Qxc1+": 829,
  "Qh8+": 830,
  "Qh1#": 831,
  "Rxh6": 832,
  "Nh4": 833,
  "fxg6": 834,
  "Bh7+": 835,
  "Qg7+": 836,
  "Rxf6+": 837,
  "Rd6+": 839,
  "Qxh7": 840,
  "Rxd5+": 841,
  "Qxg6+": 842,
  "Re5": 843,
  "Rc4": 844,
  "Qxd7+": 845,
  "Bxh8": 846,
  "Nxf8": 847,
  "Ne4+": 848,
  "Nf2+": 849,
  "Rae8": 850,
  "Ndf3": 853,
  "fxg5": 854,
  "Rf5": 855,
  "Qxe6": 856,
  "Nxg6+": 857,
  "Qd3+": 858,
  "Re8#": 859,
  "Qh7": 860,
  "Rdc1": 861,
  "axb4": 862,
  "R1c4": 863,
  "Rxc4": 864,
  "Kxc4": 865,
  "Kb7": 866,
  "Rd3+": 867,
  "Ra5+": 868,
  "Ra4+": 869,
  "g7": 870,
  "axb3": 871,
  "Nb8": 872,
  "Bb1": 873,
  "Qxh6": 874,
  "Qxh4": 875,
  "Nxh4": 876,
  "Be4+": 877,
  "c7": 878,
  "cxb4": 879,
  "Bxb6": 880,
  "Qa1+": 881,
  "Ncd4": 882,
  "a7": 883,
  "Rxb3": 884,
  "Rxd7+": 885,
  "Kc4": 886,
  "Kc6": 887,
  "Nxg7": 888,
  "Nxh5": 889,
  "Qxd8+": 891,
  "Ba2": 892,
  "Rde1": 893,
  "Rhd8": 894,
  "Bxf6+": 895,
  "e5+": 896,
  "Rhf1": 897,
  "Rf2+": 898,
  "Rf1+": 899,
  "Bxh3": 900,
  "Raf1": 901,
  "Bxf7": 902,
  "Bxf4+": 903,
  "gxf7+": 904,
  "R8e2+": 905,
  "Be5+": 906,
  "Rxb2+": 907,
  "Ka3": 908,
  "Qxh5+": 909,
  "Qa5#": 910,
  "Nxf6": 911,
  "Bc6+": 912,
  "Qa6": 913,
  "Rxg3+": 914,
  "Kxg3": 915,
  "Qd6+": 916,
  "Rh8+": 917,
  "Qxb5": 918,
  "Qxa5+": 919,
  "Rd1+": 920,
  "Rce1": 921,
  "Rxa4": 922,
  "Rxd4+": 923,
  "Kxb3": 924,
  "a8=Q": 925,
  "Qh7+": 927,
  "Rxc2": 928,
  "Ra4": 929,
  "Nfxd5": 930,
  "exd7+": 931,
  "Bxe8": 932,
  "Rd5+": 933,
  "Rxa5": 934,
  "b2": 935,
  "Rc5+": 936,
  "Qb1+": 937,
  "Qg1+": 938,
  "Qf2#": 939,
  "Qh2+": 940,
  "Qg2+": 941,
  "Be1+": 942,
  "Qb5#": 943,
  "Nf8": 944,
  "N6d7": 945,
  "Qxh8": 946,
  "Nc1+": 947,
  "Rxc1": 948,
  "Nce4": 949,
  "Nh3+": 950,
  "Kxf2": 951,
  "Qxh4+": 952,
  "Qxg5+": 953,
  "Kxh7": 954,
  "Qxa4": 955,
  "Bf1": 956,
  "Rxe3+": 957,
  "Nxg2": 958,
  "g6#": 959,
  "Nh7": 960,
  "Rdd1": 961,
  "Rcc2": 962,
  "Rfc1": 963,
  "Bxb1": 964,
  "Rxb1": 965,
  "g4+": 966,
  "Qxd5#": 967,
  "Qxh7#": 968,
  "N4a6": 969,
  "bxa4": 970,
  "Qxd1+": 971,
  "Kxd1": 972,
  "Nxe7": 973,
  "Rxd7": 974,
  "Re3+": 975,
  "Kxc2": 976,
  "f2": 977,
  "f1=Q": 978,
  "Kxb6": 979,
  "Ka6": 980,
  "Rc8+": 981,
  "Re1#": 982,
  "Nc5+": 983,
  "Rc7+": 984,
  "Rb1#": 985,
  "Nh2": 986,
  "Nxh6": 987,
  "gxf3+": 988,
  "Nb1": 989,
  "Nb1+": 990,
  "Na3+": 991,
  "Nxb5+": 992,
  "Ka5": 993,
  "Kb6": 994,
  "Kxa6": 996,
  "Kxh5": 997,
  "Kxc7": 998,
  "h2": 999,
  "c8=Q": 1000,
  "h1=Q+": 1001,
  "Qc1+": 1002,
  "Ka8": 1003,
  "Kxe4": 1004,
  "Bd3+": 1005,
  "Qxe1#": 1006,
  "Qg2#": 1007,
  "Rhf8": 1008,
  "Bxf2+": 1009,
  "Rxg3": 1010,
  "Bf7+": 1012,
  "Rh2+": 1013,
  "Rhh1": 1014,
  "Bxf3+": 1016,
  "Ndxc5": 1017,
  "Na2": 1018,
  "Bxe6+": 1019,
  "Rxe2": 1020,
  "Bxe1": 1021,
  "Rc4+": 1022,
  "Kxa8": 1023,
  "Rc8#": 1024,
  "Ne6+": 1025,
  "Rxe4+": 1026,
  "Rc6+": 1027,
  "Rh5+": 1028,
  "Nfd7": 1031,
  "Rcxc3": 1032,
  "Rab3": 1033,
  "Rh1#": 1034,
  "Qxf6+": 1035,
  "Ne2+": 1036,
  "fxe2": 1037,
  "Rxe5+": 1038,
  "Rf5+": 1039,
  "Kxb5": 1040,
  "Rb7+": 1041,
  "b3+": 1042,
  "Bf6+": 1043,
  "Kxa2": 1044,
  "Kxa4": 1045,
  "g8=Q#": 1046,
  "d1=Q+": 1048,
  "Rb5+": 1049,
  "Kc1": 1051,
  "Ka2": 1052,
  "Rcb4": 1053,
  "Ra4#": 1054,
  "Nbxd2": 1055,
  "Qxg2": 1058,
  "Nxb4": 1059,
  "Rxd8+": 1060,
  "Ra6+": 1061,
  "Rxb3+": 1062,
  "Rxh3+": 1063,
  "g2": 1064,
  "g1=Q": 1065,
  "b1=Q": 1066,
  "Nxc8": 1068,
  "Qf7": 1069,
  "Ref1": 1070,
  "gxh5": 1071,
  "Rxe7+": 1072,
  "Rg8#": 1073,
  "N8d7": 1074,
  "Qxg3": 1075,
  "dxe5+": 1076,
  "Nd4+": 1077,
  "Bb6+": 1078,
  "Bd8": 1079,
  "Bd1": 1081,
  "Nxc1": 1082,
  "Rxh1": 1083,
  "Qxb1+": 1084,
  "Bxa5": 1085,
  "Bd5+": 1086,
  "gxf4+": 1087,
  "Be3+": 1088,
  "Qxb8": 1089,
  "Ng8": 1090,
  "cxb6": 1091,
  "Red8": 1092,
  "exf4+": 1093,
  "Re5+": 1094,
  "g5+": 1095,
  "Re6+": 1096,
  "Rb1+": 1097,
  "f6+": 1098,
  "exf7+": 1099,
  "Ng6+": 1100,
  "Nxf8+": 1101,
  "Qd8+": 1102,
  "Ncxe4": 1103,
  "Bxf2": 1104,
  "Kxe1": 1105,
  "Bxh7+": 1106,
  "Nxf4+": 1107,
  "Rxd2+": 1108,
  "Nde2": 1109,
  "Nfe4": 1110,
  "Rdf8": 1111,
  "Rhg8": 1112,
  "Ba5+": 1113,
  "fxg7+": 1114,
  "Nf5+": 1115,
  "Kxb4": 1116,
  "b5+": 1117,
  "exf6+": 1118,
  "Bxa2": 1120,
  "Bxd6+": 1121,
  "Kxd6": 1122,
  "Rcf1": 1123,
  "Rb2": 1124,
  "hxg4+": 1125,
  "gxf6+": 1126,
  "Rxc4+": 1127,
  "Nxd2+": 1128,
  "Qc1": 1129,
  "Nxe4+": 1130,
  "Rfa1": 1131,
  "Nc8+": 1132,
  "Nb6+": 1133,
  "Nxa4": 1134,
  "Bxa4+": 1135,
  "f4+": 1136,
  "Kxe5": 1137,
  "Qb6+": 1138,
  "dxe7": 1139,
  "R4d5": 1142,
  "d7+": 1143,
  "Rb6+": 1145,
  "Bh7": 1146,
  "d4+": 1148,
  "d1=Q": 1149,
  "Rd4+": 1150,
  "Nf8+": 1151,
  "gxh7+": 1152,
  "cxb2+": 1153,
  "Rdf1": 1154,
  "Rhf2": 1155,
  "Rxg5+": 1156,
  "e6+": 1157,
  "Rff6": 1158,
  "Qd8#": 1159,
  "Ndxe5": 1160,
  "Rcb8": 1161,
  "Qa7+": 1162,
  "Qxd3+": 1163,
  "Qxe3+": 1164,
  "Kxe3": 1165,
  "a2": 1166,
  "g8=Q": 1167,
  "a1=Q#": 1168,
  "c5+": 1169,
  "Nb7+": 1170,
  "c3+": 1171,
  "dxc3+": 1172,
  "Kxc3": 1173,
  "Bh2+": 1174,
  "Qg8": 1175,
  "Qg3#": 1176,
  "Bxg8": 1177,
  "Rxg8": 1178,
  "Kxg8": 1179,
  "Bc1+": 1180,
  "Rcb2": 1181,
  "R1b2": 1182,
  "hxg3+": 1183,
  "b2+": 1184,
  "Nc3+": 1185,
  "b1=Q+": 1186,
  "Rb2+": 1187,
  "Qa2": 1188,
  "Rxc2+": 1189,
  "Rxb6": 1190,
  "Bd4+": 1191,
  "Rab2": 1192,
  "Rg8+": 1193,
  "g1=Q+": 1194,
  "Rxg1": 1195,
  "Re7+": 1196,
  "Kxg5": 1197,
  "Kxd2": 1198,
  "e3+": 1199,
  "f2+": 1200,
  "d3+": 1201,
  "e2+": 1202,
  "e1=Q+": 1203,
  "Qxa3": 1204,
  "Rd7+": 1205,
  "Rde7": 1206,
  "Ra3+": 1207,
  "Rxd3+": 1208,
  "exf3+": 1209,
  "fxg2+": 1210,
  "Bxh1": 1211,
  "Kxh1": 1212,
  "Ree7": 1213,
  "Rfe7": 1214,
  "Qxh1": 1215,
  "Qxg1": 1216,
  "Bf2": 1217,
  "Rfe8+": 1218,
  "Bc4+": 1219,
  "Qxg1+": 1220,
  "Bg7+": 1221,
  "Qg5#": 1222,
  "Nxd1+": 1223,
  "Bxa3": 1224,
  "Reb8": 1225,
  "Rxg2": 1226,
  "Rxh3": 1227,
  "a1=Q+": 1228,
  "Rde8+": 1230,
  "Qh3#": 1231,
  "Qe8#": 1232,
  "Qxc8": 1233,
  "gxh3": 1234,
  "Rxh6+": 1235,
  "h8=Q+": 1236,
  "Rf4#": 1237,
  "Bxc8": 1238,
  "Bxb3": 1239,
  "Ra1+": 1240,
  "Be6+": 1241,
  "Nb3+": 1242,
  "Nb5+": 1243,
  "Qf7#": 1244,
  "Nxd6+": 1245,
  "Nxg8": 1246,
  "Rhg1": 1247,
  "Rge1": 1248,
  "g6+": 1249,
  "Kxa5": 1250,
  "Bxc4+": 1251,
  "Bb8": 1252,
  "h1=Q": 1253,
  "Rbd8": 1254,
  "Qxg7+": 1255,
  "Qg6#": 1256,
  "Qxh3": 1257,
  "g3+": 1258,
  "fxg3+": 1259,
  "Rxf2+": 1260,
  "Qb3#": 1261,
  "Kxb7": 1262,
  "Kxe6": 1263,
  "Qbb7+": 1264,
  "Qxg1#": 1265,
  "Bxg3+": 1266,
  "Bxh2": 1267,
  "hxg6+": 1268,
  "Kxg6": 1269,
  "Be2+": 1270,
  "Bf4+": 1271,
  "Bd6+": 1273,
  "Bf2+": 1274,
  "Qxg2#": 1275,
  "Rf1#": 1276,
  "Kxc6": 1277,
  "Ka7": 1278,
  "Rb4+": 1279,
  "bxa1=Q": 1280,
  "Qxb7+": 1281,
  "Qxa8+": 1282,
  "Ba3+": 1283,
  "Qc8#": 1284,
  "Na8": 1285,
  "Bxh3+": 1286,
  "Nxh7+": 1287,
  "d8=Q+": 1288,
  "fxe5+": 1289,
  "Kxb2": 1290,
  "Kxa3": 1291,
  "Qb7#": 1292,
  "Nxb7+": 1293,
  "Rad8+": 1294,
  "Qa4#": 1295,
  "Rfe1+": 1296,
  "Ra8#": 1298,
  "f7": 1299,
  "Qxc2+": 1300,
  "Qxc1": 1302,
  "Nxg2+": 1303,
  "Nf1+": 1304,
  "exd6+": 1305,
  "Qxe8#": 1306,
  "Ba4+": 1307,
  "Qxc2#": 1308,
  "Nxc2+": 1309,
  "Bxe3+": 1310,
  "Rhe8+": 1311,
  "Nxf5+": 1314,
  "Nxc6+": 1315,
  "Bg8": 1316,
  "Qxf1+": 1317,
  "Qxf4+": 1318,
  "Qf1+": 1319,
  "Rd3#": 1320,
  "exd2": 1321,
  "Ne7+": 1322,
  "Nc6+": 1323,
  "Qxb4#": 1324,
  "Ngxe2": 1325,
  "O-O-O+": 1326,
  "fxg4+": 1327,
  "Bxg1": 1328,
  "Rxg4+": 1329,
  "Rxg8+": 1330,
  "Rd8#": 1331,
  "Nc7#": 1332,
  "Bf5+": 1333,
  "Nxh1": 1334,
  "gxh3+": 1335,
  "a1=Q": 1336,
  "Kxa1": 1337,
  "e8=Q": 1338,
  "Rxg7+": 1339,
  "f5+": 1340,
  "N7c6": 1341,
  "Nc2#": 1342,
  "dxc2": 1343,
  "c1=Q": 1344,
  "Rxh7+": 1345,
  "Bxg6+": 1346,
  "e8=Q+": 1347,
  "Rfd2": 1348,
  "Qa6+": 1349,
  "Nxh3": 1350,
  "Kxd4": 1351,
  "Rcd1": 1352,
  "Kxa7": 1353,
  "axb7": 1354,
  "Ncb6": 1355,
  "Nxe1": 1356,
  "Ng7+": 1357,
  "Qxc4+": 1358,
  "Rxb7+": 1359,
  "Bf7#": 1361,
  "cxb2": 1363,
  "Bf3+": 1364,
  "Bxg5+": 1365,
  "Qxg5#": 1366,
  "Qxd2+": 1367,
  "Rhc1": 1368,
  "Rdd8": 1369,
  "Ba1": 1370,
  "Ned6": 1371,
  "Nxc4+": 1372,
  "Ng4+": 1373,
  "hxg7": 1374,
  "Qg1": 1375,
  "axb6+": 1376,
  "Qxc1#": 1378,
  "Bxb5+": 1379,
  "Qf8+": 1380,
  "Qd6#": 1381,
  "Kd5+": 1382,
  "Rfg1": 1383,
  "Rg6+": 1384,
  "Ng7": 1385,
  "Nb2": 1386,
  "Nh6+": 1387,
  "Nxh5+": 1388,
  "Ree8": 1389,
  "bxa3": 1390,
  "Bxh6+": 1391,
  "Rcd8": 1392,
  "Rfxd8": 1394,
  "Rh3#": 1396,
  "Qf8#": 1397,
  "Nbxc3": 1398,
  "Rgf2": 1399,
  "Qb2#": 1400,
  "Rdg1": 1401,
  "h3+": 1402,
  "Neg5+": 1404,
  "Ree1": 1405,
  "Rxe6+": 1408,
  "Bxg2+": 1409,
  "Rdg8": 1410,
  "g2+": 1413,
  "Qxf1#": 1415,
  "Nxa5+": 1416,
  "Rxd6+": 1417,
  "f8=Q+": 1418,
  "Nge5": 1419,
  "Qxh3+": 1422,
  "dxc7": 1423,
  "Rxe1#": 1424,
  "Rde8": 1425,
  "Ref6": 1426,
  "Rbxc8": 1427,
  "Bxb8": 1428,
  "Ref8": 1429,
  "Rxg1+": 1430,
  "Kxg1": 1431,
  "Rxb5+": 1432,
  "Bb3+": 1433,
  "Nac6": 1434,
  "Ree3": 1435,
  "Nxa1": 1436,
  "Nh1": 1437,
  "Bf3#": 1438,
  "Nxf7+": 1439,
  "Kxc5": 1440,
  "g7+": 1441,
  "Bh8": 1443,
  "f7+": 1444,
  "f8=Q#": 1445,
  "Rb8+": 1446,
  "Qxh3#": 1447,
  "e7+": 1448,
  "Rxc3+": 1449,
  "Rc3+": 1450,
  "Qg8#": 1451,
  "Nef3": 1452,
  "Qxb1": 1453,
  "Nbxd4": 1454,
  "Rxa8+": 1456,
  "Rh3+": 1457,
  "Nbd4": 1458,
  "Ndxe2": 1459,
  "Rxh2": 1460,
  "Rxb6+": 1461,
  "Red6": 1462,
  "R7d6+": 1464,
  "Ngxf6": 1465,
  "Rxa2+": 1466,
  "Bg1": 1467,
  "axb5+": 1468,
  "h1=Q#": 1469,
  "Nde5": 1470,
  "Bg2+": 1472,
  "d6+": 1473,
  "Nbd6": 1474,
  "Qxg8": 1475,
  "Bxh7": 1476,
  "Re4+": 1477,
  "Qxh1+": 1478,
  "Nxd4+": 1479,
  "Qxh2": 1480,
  "Ng1": 1481,
  "Nb2+": 1482,
  "Qxd2#": 1483,
  "Nec6": 1484,
  "Nbc3": 1485,
  "Nxc3+": 1486,
  "Rxa3+": 1488,
  "Bh4+": 1489,
  "Nac7": 1491,
  "Qd2#": 1492,
  "Bxf7#": 1493,
  "Bh5+": 1494,
  "Bxe2+": 1495,
  "Ng2": 1496,
  "exf5+": 1497,
  "Rxf5+": 1498,
  "Qb6#": 1499,
  "Kxb1": 1501,
  "f8=Q": 1502,
  "Bxe1+": 1506,
  "Bg6+": 1507,
  "gxh2": 1508,
  "Kd7+": 1509,
  "Bh1": 1510,
  "Ngxe6": 1511,
  "Nh5+": 1512,
  "Na2+": 1513,
  "Ncxe5": 1514,
  "Bc7+": 1515,
  "cxb3+": 1517,
  "Rab8+": 1518,
  "Qxg2+": 1519,
  "Na1": 1520,
  "Rde4": 1521,
  "Qxf8#": 1522,
  "Qh8#": 1523,
  "Ngf3": 1524,
  "Bxe5+": 1525,
  "Qxf5+": 1526,
  "Rgd1": 1529,
  "Nxd5+": 1530,
  "N7f6": 1531,
  "Nfd4": 1532,
  "Rfxd1": 1533,
  "Nxa2+": 1534,
  "Rbe1": 1536,
  "Rbc8": 1537,
  "fxg7": 1538,
  "Qxh8+": 1539,
  "Nbd5": 1542,
  "Rec8": 1544,
  "Rxc8+": 1547,
  "Bd7+": 1548,
  "Ndf6": 1549,
  "Nxh6+": 1550,
  "Nxh3+": 1551,
  "Neg5": 1552,
  "Qa3#": 1554,
  "Rhg1+": 1555,
  "Rag1": 1556,
  "Nce5": 1563,
  "Rh5#": 1564,
  "Qxe1+": 1565,
  "Qxf7#": 1566,
  "Rxh2+": 1568,
  "Rxc6+": 1569,
  "d8=Q": 1570,
  "Rxb4+": 1571,
  "Ngh3": 1572,
  "Bxb2+": 1574,
  "Rxg1#": 1575,
  "Nac4": 1576,
  "Nxb2+": 1577,
  "Nd1+": 1578,
  "Bb7+": 1579,
  "Qd1#": 1580,
  "Bxb7+": 1581,
  "Raxa7": 1582,
  "Ra2+": 1584,
  "Rc1#": 1585,
  "Rba1": 1587,
  "Rea8": 1588,
  "Qxd4+": 1589,
  "Qd7#": 1590,
  "Rde3": 1591,
  "Bh6+": 1592,
  "Rd1#": 1594,
  "Rxe2+": 1596,
  "Bxa3+": 1597,
  "Rxb8+": 1598,
  "Qc7#": 1599,
  "Nexd5": 1601,
  "R8e2": 1602,
  "R8d2": 1603,
  "Ncxe6": 1604,
  "Nxb8": 1605,
  "Kxb8": 1606,
  "Rae8+": 1607,
  "Ne8+": 1610,
  "Ng3#": 1611,
  "Ndxe4": 1612,
  "fxg2": 1613,
  "bxa2": 1614,
  "Bg6#": 1616,
  "Nxb3+": 1617,
  "Red7": 1618,
  "d2+": 1619,
  "Rd4#": 1620,
  "Nexd4": 1622,
  "Rxc5+": 1623,
  "a4+": 1626,
  "Rec6": 1627,
  "cxb5+": 1632,
  "Rge8": 1633,
  "R8e6": 1634,
  "Qxd6+": 1637,
  "Rgxg2": 1639,
  "Qg1#": 1640,
  "exd3+": 1641,
  "bxc3+": 1642,
  "Bxd3+": 1643,
  "Qxb6+": 1644,
  "Qc1#": 1645,
  "Rdh8": 1646,
  "Bf1+": 1647,
  "Nhf4": 1655,
  "cxd5+": 1656,
  "Kxd5": 1657,
  "e4+": 1658,
  "Rde2": 1659,
  "Ngxe5": 1661,
  "Qe1#": 1662,
  "Nac2": 1663,
  "Rg2+": 1664,
  "h2+": 1665,
  "Rgg2": 1667,
  "Rdf2": 1668,
  "bxc5+": 1669,
  "Na6+": 1670,
  "Ncd5": 1673,
  "Qxe2#": 1674,
  "Nfd5": 1675,
  "Bxe7+": 1676,
  "exd2+": 1677,
  "Nd3#": 1678,
  "Bxc5+": 1680,
  "R8e7": 1682,
  "Rh8#": 1683,
  "dxc6+": 1685,
  "Rdd2": 1686,
  "Ndxb5": 1688,
  "Bd2+": 1689,
  "Rff8": 1690,
  "Nfxg4": 1691,
  "Qf1#": 1692,
  "Rhc8": 1693,
  "h6#": 1695,
  "g8=Q+": 1696,
  "Naxc5": 1697,
  "Rcc1": 1698,
  "Rxd8#": 1700,
  "cxd7": 1702,
  "Ndb5": 1705,
  "N1e2": 1706,
  "Qxh6#": 1709,
  "Nde7": 1710,
  "Bf8+": 1711,
  "Rxh6#": 1712,
  "Bxe4+": 1714,
  "R1d2": 1716,
  "Rcd7": 1719,
  "Bxd4+": 1722,
  "R8d7": 1724,
  "Rh4#": 1726,
  "Ncxd2": 1727,
  "Rbe8": 1728,
  "Nfxd4": 1729,
  "Ndc6": 1730,
  "Nhf3": 1731,
  "Qe4#": 1732,
  "Na4+": 1733,
  "Rf5#": 1735,
  "b6+": 1736,
  "dxe2": 1737,
  "Rff2": 1738,
  "Ndc4": 1741,
  "dxc7+": 1742,
  "hxg2": 1743,
  "Rag8": 1744,
  "Rbb3": 1745,
  "Rbb2": 1747,
  "Ra2#": 1748,
  "Rh2#": 1750,
  "R1f3": 1751,
  "Qa6#": 1753,
  "Bc3+": 1754,
  "Ndf8": 1755,
  "Nh8": 1756,
  "Qxb3+": 1757,
  "N5f6": 1758,
  "Ref3": 1759,
  "Rxb1+": 1760,
  "a5+": 1761,
  "Raa1": 1763,
  "Rbb1": 1764,
  "Rdxd7": 1766,
  "Rdc7": 1767,
  "fxe4+": 1768,
  "Rbe2": 1769,
  "Raa2": 1770,
  "Rcxc2": 1773,
  "Qxa7+": 1774,
  "Be7+": 1776,
  "dxc5+": 1780,
  "Qh6#": 1782,
  "Qb1#": 1783,
  "N1c3": 1784,
  "Rcc3": 1785,
  "Rhh8": 1786,
  "Bxg7+": 1787,
  "Rgh1": 1788,
  "Nd2+": 1790,
  "R1e2": 1791,
  "Rxc8#": 1795,
  "Bxg4+": 1797,
  "Bxd1+": 1798,
  "Raa6": 1799,
  "Nfxd7": 1800,
  "Nxg1+": 1801,
  "cxd4+": 1803,
  "Nxb4+": 1804,
  "N2b3": 1805,
  "Rdg8+": 1808,
  "Qxb2+": 1809,
  "bxc4+": 1810,
  "Qh4#": 1811,
  "Ncb5": 1812,
  "h6+": 1815,
  "Qh5#": 1816,
  "d5+": 1817,
  "R8f6": 1818,
  "R6f5": 1820,
  "Rgd7": 1821,
  "Nfxe4": 1822,
  "Rxh2#": 1823,
  "Nbxd5": 1827,
  "Rfd7": 1830,
  "Rfd8+": 1833,
  "Nfe5": 1835,
  "Bb8+": 1836,
  "Rxa1+": 1838,
  "Nxg5+": 1840,
  "Qa1#": 1842,
  "Ned7": 1843,
  "Qd4#": 1844,
  "Rbb8": 1845,
  "Rhf7": 1849,
  "Rgf7": 1851,
  "Qxb7#": 1853,
  "dxc4+": 1855,
  "Qxe7#": 1857,
  "Bxa5+": 1858,
  "Nfxg5": 1860,
  "Rdd4": 1861,
  "Ncxd5": 1862,
  "Rbf1": 1863,
  "Nfxe5": 1864,
  "Rfe2": 1865,
  "Rdh1": 1866,
  "N5c3": 1867,
  "Rxf8#": 1868,
  "Kg3+": 1869,
  "Nxe8+": 1871,
  "Rdb1": 1873,
  "Nce2": 1874,
  "Nb4+": 1876,
  "Rae1+": 1877,
  "Rea1": 1878,
  "Nxb1": 1879,
  "Rae7": 1880,
  "Nf3#": 1881,
  "Rf3#": 1882,
  "exf8=Q+": 1884,
  "dxe8=Q+": 1885,
  "N8e7": 1887,
  "gxf2+": 1888,
  "Bg8+": 1889,
  "axb1=Q": 1892,
  "Qa3+": 1893,
  "fxe6+": 1894,
  "c8=Q+": 1898,
  "Kxc8": 1899,
  "Qxg6#": 1900,
  "Ngxe4": 1901,
  "dxe4+": 1902,
  "R1f2": 1903,
  "Rff3": 1904,
  "Rhxg8": 1905,
  "Rgf8": 1906,
  "g1=Q#": 1907,
  "Qxb2#": 1908,
  "Qe7#": 1909,
  "Rhc2": 1910,
  "Rhg7": 1913,
  "N2f3": 1915,
  "Rg1#": 1917,
  "Ned5": 1919,
  "h7+": 1920,
  "Rdd5": 1922,
  "gxh5+": 1924,
  "gxf5+": 1925,
  "Red4": 1926,
  "Nde6": 1927,
  "Qe2#": 1928,
  "Rhe1+": 1929,
  "Neg3": 1930,
  "Nxf7#": 1932,
  "Rcc5": 1933,
  "b4+": 1935,
  "axb4+": 1936,
  "Ned4": 1937,
  "fxg6+": 1939,
  "Reg1": 1940,
  "Nxh8+": 1943,
  "R2e3+": 1945,
  "c2+": 1946,
  "Rbd1+": 1948,
  "Qe3#": 1949,
  "Kxc1": 1950,
  "Rxa5+": 1956,
  "Rbe7": 1957,
  "Rfxc1": 1958,
  "Qc5#": 1959,
  "Rxh8+": 1963,
  "Nfe3": 1964,
  "fxe7": 1965,
  "Qb4#": 1968,
  "R1a2": 1970,
  "Qa7#": 1971,
  "gxh4+": 1974,
  "N2g3": 1975,
  "Rbf8": 1976,
  "Qa2#": 1978,
  "Rf2#": 1979,
  "Rah8": 1980,
  "Na5+": 1982,
  "Bxb3+": 1983,
  "Nxg4+": 1984,
  "Nxh4+": 1985,
  "Rxh1+": 1986,
  "Rbc1": 1987,
  "Ng2+": 1988,
  "Neg6": 1991,
  "Rf7#": 1992,
  "exd5+": 1995,
  "Rde1+": 1996,
  "Bxe6#": 1998,
  "Nexg5": 1999,
  "Nfg5": 2000,
  "Rxa6+": 2001,
  "Rd7#": 2007,
  "Qh1": 2008,
  "Qf3#": 2009,
  "hxg5+": 2010,
  "Rexe7+": 2011,
  "Raf2": 2012,
  "R1e5": 2013,
  "R1e7+": 2014,
  "Rha1": 2015,
  "R8c6": 2019,
  "Ref2": 2020,
  "g3#": 2022,
  "fxe3+": 2023,
  "Nxh1+": 2024,
  "R1d5": 2026,
  "Qxg8#": 2027,
  "Nxa6+": 2029,
  "Qxf6#": 2030,
  "Rcd2": 2032,
  "Qf5#": 2033,
  "Qa8#": 2034,
  "Ngxe7": 2035,
  "Bc4#": 2036,
  "exf2": 2037,
  "Rbxb7": 2038,
  "Ne1+": 2039,
  "Re2#": 2040,
  "c7+": 2043,
  "c8=Q#": 2044,
  "cxb4+": 2045,
  "Red2": 2049,
  "Qxa4+": 2052,
  "f1=Q+": 2054,
  "Rhg7+": 2056,
  "Rfg7+": 2058,
  "c6+": 2059,
  "Rbd7": 2060,
  "Ndf5": 2062,
  "Rad1+": 2065,
  "Nba6": 2068,
  "Raxb8": 2069,
  "O-O+": 2070,
  "gxh2+": 2072,
  "Qb8#": 2073,
  "Rxa4+": 2075,
  "Bf6#": 2076,
  "Qxe6#": 2077,
  "Qxa6+": 2078,
  "Nxb8+": 2079,
  "Raxb1": 2080,
  "Ned3": 2081,
  "N1d2": 2082,
  "Rfxf7": 2083,
  "Qf4#": 2087,
  "Rxd1#": 2090,
  "dxe3+": 2096,
  "Bg4#": 2097,
  "Bc5#": 2098,
  "Rgf4": 2101,
  "axb3+": 2105,
  "Nxc5+": 2107,
  "Ng8+": 2108,
  "Rhb8": 2110,
  "a8=Q+": 2111,
  "Re5#": 2113,
  "Nh8+": 2115,
  "Rcd4": 2117,
  "Rxf3#": 2118,
  "Qxd8#": 2119,
  "Nce6": 2121,
  "Naxc4": 2122,
  "Rcf8": 2123,
  "gxh7": 2125,
  "Nxd7+": 2128,
  "N5c6": 2129,
  "Nf6#": 2130,
  "dxe6+": 2131,
  "Rgf8+": 2132,
  "Be3#": 2133,
  "Rgb8": 2134,
  "R1d3": 2135,
  "R1e3": 2136,
  "Red2+": 2140,
  "Rcg2+": 2141,
  "Rhg2+": 2142,
  "Bc6#": 2143,
  "Rff5": 2144,
  "Qxc7#": 2146,
  "Bf5#": 2147,
  "Raxc8": 2148,
  "cxd6+": 2149,
  "Qxd1#": 2151,
  "Bg1+": 2152,
  "Nhf5": 2156,
  "Nxb6+": 2159,
  "Nxf2#": 2160,
  "a3+": 2161,
  "Qxf4#": 2164,
  "hxg7+": 2165,
  "Bd5#": 2166,
  "R1c2": 2167,
  "Qxd7#": 2168,
  "Rgc8": 2169,
  "Rexe6": 2172,
  "Rd6#": 2173,
  "gxf7": 2175,
  "Kc4+": 2176,
  "Nfg4": 2178,
  "Nxc8+": 2181,
  "Nac5": 2184,
  "Nec5": 2185,
  "Rdd6": 2187,
  "Rxa7+": 2188,
  "Bxd8+": 2195,
  "bxa3+": 2196,
  "Rf8#": 2202,
  "Rd2#": 2204,
  "Nxd8+": 2205,
  "Qg4#": 2206,
  "Qe6#": 2209,
  "Rfe3": 2211,
  "Rxf2#": 2212,
  "Rcd6": 2214,
  "g4#": 2215,
  "Nac3": 2217,
  "d8=N": 2218,
  "Bxb6+": 2220,
  "Rha8": 2223,
  "Rfc7": 2228,
  "cxd2": 2230,
  "Qc2#": 2233,
  "Nxg1": 2240,
  "exd7": 2241,
  "Rcg7+": 2243,
  "Bd3#": 2244,
  "Rde6": 2245,
  "Ndc5": 2246,
  "Bxh4+": 2247,
  "Nhf6": 2251,
  "N6h5": 2255,
  "Rec3": 2256,
  "Ndb4": 2257,
  "Rfa8": 2258,
  "N3h4": 2259,
  "Nde4": 2261,
  "N7b6": 2266,
  "Qc6#": 2269,
  "N4b3": 2271,
  "Rcxc1": 2277,
  "Rfd6": 2278,
  "Rxh3#": 2279,
  "Be8+": 2281,
  "Rfxc8": 2283,
  "Nf7#": 2287,
  "N8c6": 2288,
  "Rxg8#": 2289,
  "Rxh7#": 2290,
  "gxf1=Q+": 2292,
  "Rfd1+": 2293,
  "bxc2": 2301,
  "Bxa6+": 2303,
  "R3d2": 2306,
  "Bf1#": 2311,
  "Rd5#": 2315,
  "Nxa3+": 2317,
  "Ncb4": 2319,
  "Nbc5": 2320,
  "Nxc1+": 2321,
  "Bc8+": 2323,
  "R8c7": 2324,
  "Rxc1#": 2325,
  "Qxb5#": 2328,
  "R8d6": 2331,
  "Rhg8+": 2334,
  "Ra3#": 2337,
  "Nxe1+": 2338,
  "Rxh4#": 2341,
  "Rgg6": 2343,
  "Qd3#": 2346,
  "Ng1+": 2348,
  "Bd8+": 2349,
  "Rce2": 2350,
  "Rdxd5": 2352,
  "Nec4": 2356,
  "a6+": 2359,
  "Bd1+": 2363,
  "axb2": 2365,
  "Nd6#": 2369,
  "Bb2+": 2371,
  "Rexe2": 2376,
  "Rcc8": 2377,
  "Rhf4": 2378,
  "Rah1": 2379,
  "Ke3+": 2386,
  "Ncd7": 2387,
  "c1=Q#": 2391,
  "Bxf3#": 2392,
  "Rac8+": 2393,
  "R6d3": 2399,
  "Raa8": 2404,
  "Qxf3#": 2407,
  "Nfe2": 2409,
  "Rbc2": 2411,
  "Bxa7+": 2414,
  "N4c6": 2417,
  "Raa7": 2420,
  "Nb8+": 2422,
  "Rab1+": 2426,
  "Qxc8#": 2430,
  "Reh8": 2431,
  "Rc5#": 2432,
  "Nxa4+": 2433,
  "Rhh5": 2436,
  "Raa3": 2437,
  "Rdc2": 2438,
  "Rff4": 2439,
  "Nh7+": 2444,
  "R8e5": 2446,
  "cxd3+": 2447,
  "Ba7+": 2448,
  "Rcg1": 2449,
  "Rgg7": 2451,
  "Kf1+": 2452,
  "Rdxd6": 2453,
  "Qf6#": 2454,
  "Nexg4": 2460,
  "Nd5#": 2465,
  "Qxh5#": 2469,
  "Rgh8": 2471,
  "N2c3": 2473,
  "Qe5#": 2474,
  "Bxa2+": 2476,
  "Ba2+": 2477,
  "Qxc6#": 2482,
  "bxc7": 2483,
  "Ng5#": 2484,
  "bxc6+": 2485,
  "R6d7": 2498,
  "R1h2": 2499,
  "Ncd2": 2501,
  "Rc7#": 2505,
  "Rfxf2": 2506,
  "Nef5": 2509,
  "Re3#": 2512,
  "Rgh2": 2514,
  "f4#": 2516,
  "Ra5#": 2517,
  "Bh6#": 2518,
  "Rexe7": 2524,
  "Rdf7": 2525,
  "Bxf8+": 2526,
  "Ree5": 2530,
  "a8=Q#": 2534,
  "Qc4#": 2537,
  "Rcb1": 2538,
  "e8=Q#": 2539,
  "Rac1+": 2542,
  "Bxh5+": 2543,
  "h8=Q#": 2544,
  "Bc2+": 2546,
  "Rah7": 2549,
  "Raxe8": 2552,
  "cxb6+": 2553,
  "Rexd1": 2559,
  "Rhe5": 2565,
  "Nef4": 2567,
  "Rfh8": 2574,
  "Rbc7": 2577,
  "bxa5+": 2578,
  "cxd8=Q+": 2579,
  "R1d6": 2581,
  "Reg8": 2582,
  "Ncd6": 2583,
  "Rdxd4": 2586,
  "N7g6": 2602,
  "Nh1+": 2604,
  "Bxc2+": 2606,
  "Ndxc4": 2607,
  "Rfc1+": 2610,
  "Ra6#": 2613,
  "Ra7#": 2624,
  "Red3": 2625,
  "Rde5": 2628,
  "a2+": 2629,
  "Ndf4": 2632,
  "d8=Q#": 2634,
  "Rfd3": 2635,
  "Rgf2+": 2636,
  "Rfxe1": 2640,
  "Rec2": 2645,
  "Rbg8": 2649,
  "axb7+": 2652,
  "Rch1": 2656,
  "h3#": 2659,
  "Qd5#": 2660,
  "g5#": 2667,
  "Nc3#": 2670,
  "R1d2+": 2676,
  "Rgf5": 2680,
  "R4e2": 2682,
  "Bd4#": 2684,
  "Nexd7": 2688,
  "Rfg8": 2692,
  "Bxf6#": 2693,
  "cxb7+": 2695,
  "Rxh5#": 2701,
  "Rhe2": 2707,
  "Ncxe2": 2710,
  "Rxb1#": 2712,
  "b7+": 2717,
  "Nfg6": 2725,
  "R8g7": 2727,
  "R5d2": 2728,
  "Rhf1+": 2729,
  "Rhe3": 2732,
  "Rda1": 2734,
  "R3d5": 2738,
  "Qxg3#": 2751,
  "Re7#": 2755,
  "Ndc3": 2757,
  "R7c6": 2759,
  "Rdxf7": 2772,
  "R1d4": 2775,
  "Nge3": 2783,
  "dxc8=Q+": 2792,
  "Qc3#": 2793,
  "Rce6": 2795,
  "exf1=Q+": 2796,
  "cxd7+": 2801,
  "Rbb6": 2803,
  "Bxc8+": 2805,
  "Re4#": 2809,
  "Rca1": 2818,
  "Rhxd8": 2825,
  "N3e4": 2828,
  "R3e2": 2831,
  "Bg5#": 2840,
  "c8=R": 2853,
  "Rfh1": 2854,
  "Rhh7": 2855,
  "Rea7": 2859,
  "Qxa2#": 2867,
  "Ncxb5": 2868,
  "Rec7": 2869,
  "Ref7": 2871,
  "Kf3+": 2874,
  "Ree6": 2879,
  "Rcd5": 2894,
  "Rf6#": 2895,
  "Rdxd3": 2908,
  "Rcc6": 2911,
  "Rgd6": 2912,
  "Rce3": 2914,
  "Rcxc7": 2921,
  "N8f6": 2922,
  "a7+": 2931,
  "Ndxb4": 2932,
  "Reb2": 2942,
  "Bg7#": 2946,
  "dxe1=Q": 2950,
  "Qca2#": 2952,
  "Nhxf4": 2953,
  "g1=R": 2963,
  "R7g6+": 2968,
  "Rgc1": 2973,
  "axb2+": 2975,
  "R8d2+": 2977,
  "Ncd5+": 2989,
  "Nce3": 3023,
  "R8f7": 3024,
  "Be5#": 3025,
  "Nfxd2": 3029,
  "Rhd1+": 3030,
  "bxa8=Q": 3043,
  "Rfg7": 3061,
  "Rbg1": 3083,
  "Nxa8+": 3084,
  "Ree4": 3101,
  "Bxf2#": 3114,
  "gxf2": 3116,
  "Rab7": 3134,
  "Ngxf7": 3139,
  "Nbd3": 3141,
  "Reh1": 3154,
  "Rfxf3": 3158,
  "Ncd3+": 3160,
  "Rbxc1": 3175,
  "Nge6": 3182,
  "Raxe1": 3212,
  "N1h2": 3217,
  "Rbc3": 3220,
  "Nhg4": 3246,
  "Ncd4+": 3276,
  "Raxa3": 3289,
  "Rhh3": 3292,
  "R6d2": 3298,
  "Nde3": 3299,
  "Rba8": 3338,
  "Rab6": 3352,
  "Rhh2": 3374,
  "Rae2": 3375,
  "Nfg3": 3377,
  "R6f7": 3396,
  "Rcf2": 3409,
  "R1d7+": 3422,
  "Rgb1": 3439,
  "R5f6": 3467,
  "Nxg8+": 3473,
  "Rgg3": 3478,
  "cxd8=Q": 3506,
  "Rce7": 3548,
  "Nef5+": 3552,
  "cxd2+": 3604,
  "Rba3": 3624,
  "Rcc4": 3628,
  "Ke6+": 3699,
  "Rda8": 3802,
  "Rhe6": 3818,
  "Nhg5": 3820,
  "N6e5": 3839,
  "N6d5": 4228,
  "<PAD>": 0,
  "<SOS>": 1,
  "<EOS>": 2,
  "<UNK>": 3
}